lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
/* HIP/ROCm runner for SAM 3D Body (DINOv3-H+ variant, RDNA4).
 *
 * Port of cuda/sam3d_body/cuda_sam3d_body_runner.c. rocew + HIPRTC compile
 * + safetensors upload of the DINOv3-H+ encoder weights.
 *
 * Upstream layout (from ckpt slice `sam3d_body_dinov3.safetensors`,
 * prefix `backbone.encoder.`):
 *   patch_embed.proj.weight   F32 (1280, 3, 16, 16)   — kept F32; tiny
 *   patch_embed.proj.bias     F32 (1280,)
 *   cls_token                 F32 (1, 1, 1280)
 *   storage_tokens            F32 (1, 4, 1280)        — 4 register tokens
 *   rope_embed.periods        F32 (16,)               — saved RoPE periods
 *   norm.weight/bias          F32 (1280,)             — final LayerNorm
 *   blocks.{i=0..31}:
 *     norm1.weight/bias       F32 (1280,)
 *     norm2.weight/bias       F32 (1280,)
 *     attn.qkv.weight         F16 (3840, 1280)        — big matmul
 *     attn.qkv.bias           F32 (3840,)             — all-zero in ckpt
 *     attn.proj.weight        F16 (1280, 1280)
 *     attn.proj.bias          F32 (1280,)
 *     ls1.gamma, ls2.gamma    F32 (1280,)
 *     mlp.w1/w2.weight        F16 (5120, 1280)        — SwiGLU gates
 *     mlp.w1/w2.bias          F32 (5120,)
 *     mlp.w3.weight           F16 (1280, 5120)        — SwiGLU down-proj
 *     mlp.w3.bias             F32 (1280,)
 *
 * Dims: D=1280, H=20, Dh=64, N=32 blocks, ffn=5120, patch=16, image=512
 *       → grid 32×32 = 1024 patch tokens + 1 CLS + 4 register = 1029.
 *
 * SPDX-License-Identifier: MIT
 */

#include "hip_sam3d_body_runner.h"
#include "../rocew.h"
#include "../hip_kernels_common.h"
#include "hip_sam3d_body_kernels.h"
#define HIP_RUNNER_COMMON_IMPLEMENTATION
#include "../hip_runner_common.h"

#ifndef HIP_LAUNCH_PARAM_BUFFER_POINTER
#define HIP_LAUNCH_PARAM_BUFFER_POINTER ((void *)(uintptr_t)0x01)
#define HIP_LAUNCH_PARAM_BUFFER_SIZE    ((void *)(uintptr_t)0x02)
#define HIP_LAUNCH_PARAM_END            ((void *)(uintptr_t)0x03)
#endif

#ifndef HIP_SAM3D_BODY_RUNNER_EXTERNAL_IMPLS
#define SAFETENSORS_IMPLEMENTATION
#endif
#include "../../common/safetensors.h"

#if defined(_OPENMP)
#  include <omp.h>
#  define SAM3DB_MHR_THREADS() omp_get_max_threads()
#else
#  define SAM3DB_MHR_THREADS() 1
#endif

/* CPU decoder + MHR helpers — declarations only. The implementations
 * live in sam3d_body_cpu.c, which is linked alongside this TU. They
 * provide: sam3d_body_decoder_load/free, compute_bbox_affine,
 * default_cam_int, compute_ray_cond_xyz, compute_condition_info,
 * invalid_prompt_token, decode_pose_raw, keypoints_from_mesh,
 * camera_project, mhr_load/free/forward, plus the
 * s3db_extract_jcoords_meters static helper available via the header. */
#include "../../common/sam3d_body_decoder.h"
#include "../../common/sam3d_body_mhr.h"
#define CPU_COMPUTE_IMPLEMENTATION
#include "../../common/cpu_compute.h"

#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#define HIP_SAM3D_BODY_E_OK              (0)
#define HIP_SAM3D_BODY_E_INVAL           (-1)
#define HIP_SAM3D_BODY_E_NOT_IMPLEMENTED (-2)
#define HIP_SAM3D_BODY_E_LOAD            (-3)

static double sb_time_ms(void)
{
    struct timespec ts;
    clock_gettime(CLOCK_MONOTONIC, &ts);
    return (double)ts.tv_sec * 1000.0 + (double)ts.tv_nsec * 1.0e-6;
}

/* DINOv3-H+ constants (match common/dinov3.h for sam-3d-body). */
#define SB_DIM       1280
#define SB_HEADS     20
#define SB_HEAD_DIM  64
#define SB_N_BLK     32
#define SB_FFN       5120
#define SB_PATCH     16
#define SB_IMG       512
#define SB_GRID      (SB_IMG / SB_PATCH)     /* 32 */
#define SB_N_PATCH   (SB_GRID * SB_GRID)      /* 1024 */
#define SB_N_STORAGE 4
#define SB_N_TOK     (1 + SB_N_STORAGE + SB_N_PATCH)  /* 1029 */
#define SB_LN_EPS    1e-5f

/* ViT-H/16 (vit_hmr_512_384) constants — see common/sam3d_body_vit.h.
 * dim=1280, heads=16, head_dim=80, depth=32, ffn=5120, patch=16 (pad=2),
 * input 512×384 → grid 32×24 = 768 patches. No CLS/storage tokens. */
#define SB_VITH_DIM        1280
#define SB_VITH_HEADS      16
#define SB_VITH_HEAD_DIM   80
#define SB_VITH_N_BLK      32
#define SB_VITH_FFN        5120
#define SB_VITH_PATCH      16
#define SB_VITH_PAD        2
#define SB_VITH_IMG_H      512
#define SB_VITH_IMG_W      384
#define SB_VITH_GRID_H     (SB_VITH_IMG_H / SB_VITH_PATCH)   /* 32 */
#define SB_VITH_GRID_W     (SB_VITH_IMG_W / SB_VITH_PATCH)   /* 24 */
#define SB_VITH_N_PATCH    (SB_VITH_GRID_H * SB_VITH_GRID_W) /* 768 */
#define SB_VITH_LN_EPS     1e-6f

typedef struct {
    void *norm1_w, *norm1_b;    /* F32 (D,) */
    void *norm2_w, *norm2_b;
    void *qkv_w;                /* F16 (3D, D) */
    void *qkv_b;                /* F32 (3D,)  — all-zero in ckpt but uploaded anyway */
    void *proj_w;               /* F16 (D, D) */
    void *proj_b;               /* F32 (D,) */
    void *ls1;                  /* F32 (D,) */
    void *ls2;                  /* F32 (D,) */
    void *w1_w, *w1_b;          /* F16 (FFN, D) / F32 (FFN,) */
    void *w2_w, *w2_b;          /* F16 (FFN, D) / F32 (FFN,) */
    void *w3_w, *w3_b;          /* F16 (D, FFN) / F32 (D,) */
} sb_block;

/* ViT-H/16 block weights — lighter than DINOv3 (no LayerScale, no
 * SwiGLU). 2-weight GELU MLP: fc1: D→FFN, fc2: FFN→D. */
typedef struct {
    void *norm1_w, *norm1_b;    /* F32 (D,) */
    void *norm2_w, *norm2_b;
    void *qkv_w;                /* F16 (3D, D) */
    void *qkv_b;                /* F32 (3D,) */
    void *proj_w;               /* F16 (D, D) */
    void *proj_b;               /* F32 (D,) */
    void *fc1_w, *fc1_b;        /* F16 (FFN, D) / F32 (FFN,) */
    void *fc2_w, *fc2_b;        /* F16 (D, FFN) / F32 (D,) */
} sb_block_vith;

/* Decoder constants. */
#define SB_DEC_DIM       1024   /* token channel */
#define SB_DEC_KV_DIM    SB_DIM /* image channel = encoder dim 1280 */
#define SB_DEC_HEADS     8
#define SB_DEC_HEAD_DIM  64
#define SB_DEC_PROJ_DIM  (SB_DEC_HEADS * SB_DEC_HEAD_DIM) /* 512 */
#define SB_DEC_FFN       1024
#define SB_DEC_LAYERS    6
#define SB_DEC_KP        70
#define SB_DEC_HAND_TOK  2
#define SB_DEC_NPOSE     519
#define SB_DEC_NCAM      3
#define SB_DEC_COND      3
#define SB_DEC_LN_EPS    1e-6f

