lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
/* One decoder-layer's device weights (mirrors common/sam3d_body_decoder.h). */
typedef struct {
    void *ln1_w,    *ln1_b;
    void *ln_pe_1_w,*ln_pe_1_b;
    void *ln2_1_w,  *ln2_1_b;
    void *ln2_2_w,  *ln2_2_b;
    void *ln_pe_2_w,*ln_pe_2_b;
    void *ln3_w,    *ln3_b;
    void *sa_q_w,   *sa_q_b;     /* (512, 1024) f32 */
    void *sa_k_w,   *sa_k_b;
    void *sa_v_w,   *sa_v_b;
    void *sa_proj_w,*sa_proj_b;  /* (1024, 512) */
    void *ca_q_w,   *ca_q_b;     /* (512, 1024) */
    void *ca_k_w,   *ca_k_b;     /* (512, 1280) */
    void *ca_v_w,   *ca_v_b;     /* (512, 1280) */
    void *ca_proj_w,*ca_proj_b;  /* (1024, 512) */
    void *ffn0_w,   *ffn0_b;     /* (1024, 1024) */
    void *ffn1_w,   *ffn1_b;     /* (1024, 1024) */
} sb_dec_layer_w;

/* All decoder + MHR-head device weights. F32 throughout (CPU port keeps
 * decoder weights in F32 since they're small enough for free precision). */
typedef struct {
    int loaded;

    /* Top-level weights (decoder safetensors). */
    void *ray_cond_conv_w;       /* (1280, 1379, 1, 1) — bias=False */
    void *ray_cond_norm_w, *ray_cond_norm_b; /* (1280,) */
    void *init_to_token_w, *init_to_token_b;     /* (1024, 525) */
    void *prev_to_token_w, *prev_to_token_b;     /* (1024, 522) */
    void *prompt_to_token_w, *prompt_to_token_b; /* (1024, 1280) */
    void *keypoint_embedding;    /* (70, 1024) */
    void *keypoint3d_embedding;  /* (70, 1024) */
    void *hand_box_embedding;    /* (2, 1024) */
    void *kp_feat_linear_w, *kp_feat_linear_b;       /* (1024, 1280) */
    void *kp_posemb_l0_w, *kp_posemb_l0_b;           /* (1024, 2) */
    void *kp_posemb_l1_w, *kp_posemb_l1_b;           /* (1024, 1024) */
    void *kp3d_posemb_l0_w, *kp3d_posemb_l0_b;       /* (1024, 3) */
    void *kp3d_posemb_l1_w, *kp3d_posemb_l1_b;       /* (1024, 1024) */
    void *prompt_pe_gauss;       /* (2, 640) — for get_dense_pe */
    void *invalid_point_embed;   /* (1, 1280) */

    sb_dec_layer_w layers[SB_DEC_LAYERS];

    void *norm_final_w, *norm_final_b;  /* (1024,) */

    /* MHR-head regression (mhr_head safetensors). */
    void *head_pose_l0_w,   *head_pose_l0_b;    /* (1024, 1024) */
    void *head_pose_l1_w,   *head_pose_l1_b;    /* (519, 1024) */
    void *head_camera_l0_w, *head_camera_l0_b;  /* (1024, 1024) */
    void *head_camera_l1_w, *head_camera_l1_b;  /* (3, 1024) */
    void *init_pose;             /* (1, 519) */
    void *init_camera;           /* (1, 3) */

    /* MHR-head decode tables (head_pose.* in mhr_head safetensors). */
    void *scale_mean;            /* (68,) f32 */
    void *scale_comps;           /* (28, 68) f32 */
    void *hand_pose_mean;        /* (54,) f32 */
    void *hand_pose_comps;       /* (54, 54) f32 */
    void *hand_idx_left;         /* (27,) i64 */
    void *hand_idx_right;        /* (27,) i64 */
    void *keypoint_mapping;      /* (308, 18566) f32 */
    void *local_to_world_wrist;  /* (3, 3) f32 */
    void *right_wrist_coords;    /* (3,) f32 */
    void *root_coords;           /* (3,) f32 */
    void *nonhand_param_idxs;    /* (145,) i64 */

    /* faces (36874, 3) i64 — kept on host for OBJ writer (loaded via
     * the host i64 buffer, copied into ctx->faces as i32). */
    int64_t *host_faces_i64;     int n_faces;

    /* Host (mmap-backed) pointers to the norm_final + head_pose + head_camera
     * weights so we can run that tail block on CPU. The GEMVs are tiny
     * (1024×1024 + 1024×519 + 1024×3 per call); the host copies cost nothing
     * since safetensors_data() returns into the mmap. Reduces D↔H bounces in
     * the between-layer / post-loop pose+cam regression path. */
    const float *norm_final_w_h, *norm_final_b_h;        /* (1024,) */
    const float *head_pose_l0_w_h, *head_pose_l0_b_h;    /* (1024, 1024) / (1024,) */
    const float *head_pose_l1_w_h, *head_pose_l1_b_h;    /* (519, 1024)  / (519,)  */
    const float *head_camera_l0_w_h, *head_camera_l0_b_h;/* (1024, 1024) / (1024,) */
    const float *head_camera_l1_w_h, *head_camera_l1_b_h;/* (3, 1024)    / (3,)    */
} sb_dec_w;

typedef struct {
    float *data;
    int    n, c;
} f32_2d;

struct hip_sam3d_body_ctx {
    hip_sam3d_body_config cfg;
    int device_id;
    int verbose;
    int sm;
    hipModule_t mod;
    hipFunction_t fn_sentinel;
    hipFunction_t fn_resize, fn_patch, fn_prepend;
    hipFunction_t fn_bf16_round;
    hipFunction_t fn_ln, fn_gemm_tiled, fn_gemm_wmma;
    hipFunction_t fn_rope_qk, fn_kv_tx, fn_fa, fn_fa_wmma;
    hipFunction_t fn_silu_mul, fn_layerscale_add;
    hipFunction_t fn_ray_cond_fourier, fn_conv1x1_chw, fn_ln_chw;
    hipFunction_t fn_linear_bias;
    hipFunction_t fn_gemm_f32, fn_add_two, fn_add_inplace, fn_gelu_inplace, fn_sdpa;
    hipFunction_t fn_relu_inplace, fn_grid_sample, fn_kp_pelvis_norm,
                  fn_augment_overwrite_mask;
    /* ViT-H specific kernels. */
    hipFunction_t fn_patch_pad2, fn_pos_embed_vith, fn_qkv_split;
    /* MHR-on-GPU (Step 7 — speculative). */
    hipFunction_t fn_mhr_blend;
    hipFunction_t fn_mhr_lbs;
    st_context *st_enc;
    int weights_ready;

    /* encoder weights (device ptrs). */
    void    *w_patch_w, *w_patch_b;    /* F32 (D, 3, P, P) / F32 (D,) */
    void    *w_cls;                     /* F32 (1, 1, D) */
    void    *w_storage;                 /* F32 (1, S, D) */
    void    *w_rope_periods;            /* F32 (16,) */
    void    *w_rope_cos, *w_rope_sin;   /* F32 (N_PATCH, HEAD_DIM) — built host-side */
    void    *w_norm_w, *w_norm_b;       /* F32 (D,) final LN */
    sb_block blk[SB_N_BLK];

    /* ViT-H/16 backbone (separate set; only loaded when
     * cfg.backbone == VITH). */
    void    *w_vith_pos_embed;          /* F32 (1, n_patches+1, D) */
    sb_block_vith vith_blk[SB_VITH_N_BLK];

    /* Decoder + MHR-head safetensors and uploaded weights. */
    st_context *st_dec;
    st_context *st_mhr;
    sb_dec_w    dec;

    /* CPU model + MHR assets — used in the per-layer decoder loop for
     * decode_pose_raw / mhr_forward / keypoints_from_mesh /
     * camera_project (Step 9). MHR skinning on GPU lives in Step 7
     * (deferred). cpu_mhr is NULL until cfg.mhr_assets_dir is set. */
    sam3d_body_decoder_model *cpu_dec;
    sam3d_body_mhr_assets    *cpu_mhr;
    /* GPU pose_correctives matvec offload (SAM3D_MHR_GPU): LW resident. */
    int   mhr_gpu_pc;                 /* 1 if the GPU matvec hook is installed */
    hipFunction_t fn_mhr_pc_matvec;   /* optimized GEMV (NULL → gemm_f32_bias) */
    void *d_pc_lw;                    /* resident LW [55317,3000] f32 (633 MiB) */
    void *d_pc_h;                     /* scratch h  [3000] f32 */
    void *d_pc_out;                   /* scratch out [55317] f32 */

