lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    /* device runtime buffers. */
    void    *d_img_u8;  size_t img_u8_cap;   /* (Hin, Win, 3) u8, host-resized */
    void    *d_img_f32;                       /* (3, IMG, IMG) f32 normalized */
    void    *d_tok;                           /* (N_TOK, D) f32 residual stream */
    void    *d_ln;                            /* (N_TOK, D) f32 LN scratch */
    void    *d_qkv;                           /* (N_TOK, 3D) f32 fused QKV */
    void    *d_kt, *d_vt;                     /* (HEADS, N_TOK, HEAD_DIM) */
    void    *d_attn;                          /* (N_TOK, D) attention output */
    void    *d_proj;                          /* (N_TOK, D) post-proj scratch */
    void    *d_gate, *d_up;                   /* (N_TOK, FFN) SwiGLU */

    /* host-side runtime state (same shape as scaffold). */
    uint8_t *image_rgb;  int img_w, img_h;
    float    bbox[4];    int has_bbox;
    float    focal_hint;
    int      has_norm_input;  /* 1 if d_img_f32 already populated via debug API */

    /* TopdownAffine outputs cached by run_encoder so run_decoder can reuse
     * them (CPU runner mirrors this — encoder + decoder must agree on the
     * same warp matrix or the decoder cam_int / rays_xyz disagree with the
     * actual image fed to DINOv3). */
    int      self_pp_set;
    float    self_center[2];
    float    self_scale[2];
    float    self_warp[6];
    float    self_cam_int[9];

    f32_2d   encoder_tokens;
    float   *mhr_params;   int mhr_params_n;
    float    cam_t[3];
    float    focal_px;
    float   *vertices;     int n_vertices;
    int32_t *faces;        int n_faces;
    float   *keypoints_3d; int n_kp_3d;
    float   *keypoints_2d; int n_kp_2d;
};

/* ===================== safetensors helpers ===================== */

static int sb_find(const st_context *st, const char *s) {
    char k[256]; snprintf(k, sizeof(k), "backbone.encoder.%s", s);
    return safetensors_find(st, k);
}

/* ViT-H prefix is `backbone.` (no `encoder.` segment). */
static int sb_find_vith(const st_context *st, const char *s) {
    char k[256]; snprintf(k, sizeof(k), "backbone.%s", s);
    return safetensors_find(st, k);
}

static void *sb_upload_f32(const st_context *st, const char *s, size_t expect_n) {
    int i = sb_find(st, s);
    if (i < 0) { fprintf(stderr, "sam3d_body: missing %s\n", s); return NULL; }
    if (strcmp(safetensors_dtype(st, i), "F32") != 0) {
        fprintf(stderr, "sam3d_body: %s not F32 (%s)\n", s, safetensors_dtype(st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes(st, i);
    if (expect_n && nb / 4 != expect_n) {
        fprintf(stderr, "sam3d_body: %s size mismatch: got %zu f32, expected %zu\n",
                s, nb / 4, expect_n);
        return NULL;
    }
    return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
}

static void *sb_upload_f16(const st_context *st, const char *s, size_t expect_n) {
    int i = sb_find(st, s);
    if (i < 0) { fprintf(stderr, "sam3d_body: missing %s\n", s); return NULL; }
    const char *dt = safetensors_dtype(st, i);
    size_t nb = safetensors_nbytes(st, i);
    size_t n;
    if (!strcmp(dt, "F16")) {
        n = nb / 2;
        if (expect_n && n != expect_n) {
            fprintf(stderr, "sam3d_body: %s f16 size mismatch: %zu vs %zu\n",
                    s, n, expect_n);
            return NULL;
        }
        return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
    }
    if (!strcmp(dt, "F32")) {
        n = nb / 4;
        if (expect_n && n != expect_n) {
            fprintf(stderr, "sam3d_body: %s f32→f16 size mismatch: %zu vs %zu\n",
                    s, n, expect_n);
            return NULL;
        }
        const float *src = (const float *)safetensors_data((st_context *)st, i);
        uint16_t *t = (uint16_t *)malloc(n * 2);
        for (size_t k = 0; k < n; k++) t[k] = hip_f32_to_f16(src[k]);
        void *d = hip_upload_raw(t, n * 2);
        free(t);
        return d;
    }
    fprintf(stderr, "sam3d_body: %s unsupported dtype %s\n", s, dt);
    return NULL;
}

/* `backbone.<name>` variants for the ViT-H backbone. */
static void *sb_upload_vith_f32(const st_context *st, const char *s,
                                size_t expect_n) {
    int i = sb_find_vith(st, s);
    if (i < 0) { fprintf(stderr, "sam3d_body_vith: missing %s\n", s); return NULL; }
    if (strcmp(safetensors_dtype(st, i), "F32") != 0) {
        fprintf(stderr, "sam3d_body_vith: %s not F32 (%s)\n",
                s, safetensors_dtype(st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes(st, i);
    if (expect_n && nb / 4 != expect_n) {
        fprintf(stderr, "sam3d_body_vith: %s size mismatch: got %zu f32, expected %zu\n",
                s, nb / 4, expect_n);
        return NULL;
    }
    return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
}

static void *sb_upload_vith_f16(const st_context *st, const char *s,
                                size_t expect_n) {
    int i = sb_find_vith(st, s);
    if (i < 0) { fprintf(stderr, "sam3d_body_vith: missing %s\n", s); return NULL; }
    const char *dt = safetensors_dtype(st, i);
    size_t nb = safetensors_nbytes(st, i);
    size_t n;
    if (!strcmp(dt, "F16")) {
        n = nb / 2;
        if (expect_n && n != expect_n) {
            fprintf(stderr, "sam3d_body_vith: %s f16 size mismatch: %zu vs %zu\n",
                    s, n, expect_n);
            return NULL;
        }
        return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
    }
    if (!strcmp(dt, "F32")) {
        n = nb / 4;
        if (expect_n && n != expect_n) {
            fprintf(stderr, "sam3d_body_vith: %s f32→f16 size mismatch: %zu vs %zu\n",
                    s, n, expect_n);
            return NULL;
        }
        const float *src = (const float *)safetensors_data((st_context *)st, i);
        uint16_t *t = (uint16_t *)malloc(n * 2);
        for (size_t k = 0; k < n; k++) t[k] = hip_f32_to_f16(src[k]);
        void *d = hip_upload_raw(t, n * 2);
        free(t);
        return d;
    }
    fprintf(stderr, "sam3d_body_vith: %s unsupported dtype %s\n", s, dt);
    return NULL;
}

