lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
static int sb_load_block_vith(hip_sam3d_body_ctx *c, int bi) {
    sb_block_vith *b = &c->vith_blk[bi];
    char k[160];
    #define K(suf) (snprintf(k, sizeof(k), "blocks.%d." suf, bi), k)
    b->norm1_w = sb_upload_vith_f32(c->st_enc, K("norm1.weight"), SB_VITH_DIM);
    b->norm1_b = sb_upload_vith_f32(c->st_enc, K("norm1.bias"),   SB_VITH_DIM);
    b->norm2_w = sb_upload_vith_f32(c->st_enc, K("norm2.weight"), SB_VITH_DIM);
    b->norm2_b = sb_upload_vith_f32(c->st_enc, K("norm2.bias"),   SB_VITH_DIM);
    b->qkv_w   = sb_upload_vith_f16(c->st_enc, K("attn.qkv.weight"),
                                    (size_t)3 * SB_VITH_DIM * SB_VITH_DIM);
    b->qkv_b   = sb_upload_vith_f32(c->st_enc, K("attn.qkv.bias"),
                                    (size_t)3 * SB_VITH_DIM);
    b->proj_w  = sb_upload_vith_f16(c->st_enc, K("attn.proj.weight"),
                                    (size_t)SB_VITH_DIM * SB_VITH_DIM);
    b->proj_b  = sb_upload_vith_f32(c->st_enc, K("attn.proj.bias"), SB_VITH_DIM);
    b->fc1_w   = sb_upload_vith_f16(c->st_enc, K("mlp.fc1.weight"),
                                    (size_t)SB_VITH_FFN * SB_VITH_DIM);
    b->fc1_b   = sb_upload_vith_f32(c->st_enc, K("mlp.fc1.bias"), SB_VITH_FFN);
    b->fc2_w   = sb_upload_vith_f16(c->st_enc, K("mlp.fc2.weight"),
                                    (size_t)SB_VITH_DIM * SB_VITH_FFN);
    b->fc2_b   = sb_upload_vith_f32(c->st_enc, K("mlp.fc2.bias"), SB_VITH_DIM);
    #undef K
    if (!b->norm1_w || !b->norm1_b || !b->norm2_w || !b->norm2_b ||
        !b->qkv_w || !b->qkv_b || !b->proj_w || !b->proj_b ||
        !b->fc1_w || !b->fc1_b || !b->fc2_w || !b->fc2_b)
        return -1;
    return 0;
}

static int sb_load_block(hip_sam3d_body_ctx *c, int bi) {
    sb_block *b = &c->blk[bi];
    char k[160];
    #define K(suf) (snprintf(k, sizeof(k), "blocks.%d." suf, bi), k)
    b->norm1_w = sb_upload_f32(c->st_enc, K("norm1.weight"), SB_DIM);
    b->norm1_b = sb_upload_f32(c->st_enc, K("norm1.bias"),   SB_DIM);
    b->norm2_w = sb_upload_f32(c->st_enc, K("norm2.weight"), SB_DIM);
    b->norm2_b = sb_upload_f32(c->st_enc, K("norm2.bias"),   SB_DIM);
    b->qkv_w   = sb_upload_f16(c->st_enc, K("attn.qkv.weight"), (size_t)3 * SB_DIM * SB_DIM);
    b->qkv_b   = sb_upload_f32(c->st_enc, K("attn.qkv.bias"),   (size_t)3 * SB_DIM);
    b->proj_w  = sb_upload_f16(c->st_enc, K("attn.proj.weight"), (size_t)SB_DIM * SB_DIM);
    b->proj_b  = sb_upload_f32(c->st_enc, K("attn.proj.bias"),   SB_DIM);
    b->ls1     = sb_upload_f32(c->st_enc, K("ls1.gamma"), SB_DIM);
    b->ls2     = sb_upload_f32(c->st_enc, K("ls2.gamma"), SB_DIM);
    b->w1_w    = sb_upload_f16(c->st_enc, K("mlp.w1.weight"), (size_t)SB_FFN * SB_DIM);
    b->w1_b    = sb_upload_f32(c->st_enc, K("mlp.w1.bias"),   SB_FFN);
    b->w2_w    = sb_upload_f16(c->st_enc, K("mlp.w2.weight"), (size_t)SB_FFN * SB_DIM);
    b->w2_b    = sb_upload_f32(c->st_enc, K("mlp.w2.bias"),   SB_FFN);
    b->w3_w    = sb_upload_f16(c->st_enc, K("mlp.w3.weight"), (size_t)SB_DIM * SB_FFN);
    b->w3_b    = sb_upload_f32(c->st_enc, K("mlp.w3.bias"),   SB_DIM);
    #undef K
    if (!b->norm1_w || !b->norm1_b || !b->norm2_w || !b->norm2_b ||
        !b->qkv_w || !b->qkv_b || !b->proj_w || !b->proj_b ||
        !b->ls1 || !b->ls2 ||
        !b->w1_w || !b->w1_b || !b->w2_w || !b->w2_b || !b->w3_w || !b->w3_b)
        return -1;
    return 0;
}

/* ---- decoder/MHR-head loaders (Step 5a) ---- */

/* Look up `name` in `st`, verify dtype is F32, upload to device. */
/* Return host pointer into the mmapped safetensors blob (no copy, no
 * upload). Caller must keep the st_context alive. */
static const float *sb_host_st_f32(const st_context *st, const char *name,
                                   size_t expect_n) {
    int i = safetensors_find((st_context *)st, name);
    if (i < 0) {
        fprintf(stderr, "sam3d_body: missing %s\n", name);
        return NULL;
    }
    if (strcmp(safetensors_dtype((st_context *)st, i), "F32") != 0) {
        fprintf(stderr, "sam3d_body: %s not F32 (got %s)\n",
                name, safetensors_dtype((st_context *)st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes((st_context *)st, i);
    if (expect_n && nb / 4 != expect_n) {
        fprintf(stderr, "sam3d_body: %s size %zu f32 vs %zu expected\n",
                name, nb / 4, expect_n);
        return NULL;
    }
    return (const float *)safetensors_data((st_context *)st, i);
}

static void *sb_upload_st_f32(const st_context *st, const char *name,
                              size_t expect_n) {
    int i = safetensors_find((st_context *)st, name);
    if (i < 0) {
        fprintf(stderr, "sam3d_body: missing %s\n", name);
        return NULL;
    }
    if (strcmp(safetensors_dtype((st_context *)st, i), "F32") != 0) {
        fprintf(stderr, "sam3d_body: %s not F32 (got %s)\n",
                name, safetensors_dtype((st_context *)st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes((st_context *)st, i);
    if (expect_n && nb / 4 != expect_n) {
        fprintf(stderr, "sam3d_body: %s size %zu f32 vs %zu expected\n",
                name, nb / 4, expect_n);
        return NULL;
    }
    return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
}

static void *sb_upload_st_i64(const st_context *st, const char *name,
                              size_t expect_n) {
    int i = safetensors_find((st_context *)st, name);
    if (i < 0) {
        fprintf(stderr, "sam3d_body: missing %s\n", name);
        return NULL;
    }
    if (strcmp(safetensors_dtype((st_context *)st, i), "I64") != 0) {
        fprintf(stderr, "sam3d_body: %s not I64 (got %s)\n",
                name, safetensors_dtype((st_context *)st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes((st_context *)st, i);
    if (expect_n && nb / 8 != expect_n) {
        fprintf(stderr, "sam3d_body: %s size %zu i64 vs %zu expected\n",
                name, nb / 8, expect_n);
        return NULL;
    }
    return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
}

/* Per-layer load. Returns 0 on success, -1 on failure. */
static int sb_load_dec_layer(hip_sam3d_body_ctx *c, int li) {
    sb_dec_layer_w *L = &c->dec.layers[li];
    char p[192];
    const st_context *dec = c->st_dec;

