lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    #define LD_LN(prefix, fld_w, fld_b)                                 \
        do {                                                            \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".weight", li);             \
            L->fld_w = sb_upload_st_f32(dec, p, SB_DEC_DIM);            \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".bias", li);               \
            L->fld_b = sb_upload_st_f32(dec, p, SB_DEC_DIM);            \
            if (!L->fld_w || !L->fld_b) return -1;                      \
        } while (0)

    /* For LNs that normalize the (1280,) image stream. */
    #define LD_LN_KV(prefix, fld_w, fld_b)                              \
        do {                                                            \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".weight", li);             \
            L->fld_w = sb_upload_st_f32(dec, p, SB_DEC_KV_DIM);         \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".bias", li);               \
            L->fld_b = sb_upload_st_f32(dec, p, SB_DEC_KV_DIM);         \
            if (!L->fld_w || !L->fld_b) return -1;                      \
        } while (0)

    #define LD_PROJ(prefix, fld_w, fld_b, w_n, b_n)                     \
        do {                                                            \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".weight", li);             \
            L->fld_w = sb_upload_st_f32(dec, p, w_n);                   \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".bias", li);               \
            L->fld_b = sb_upload_st_f32(dec, p, b_n);                   \
            if (!L->fld_w || !L->fld_b) return -1;                      \
        } while (0)

    LD_LN("ln1",     ln1_w,     ln1_b);
    LD_LN("ln_pe_1", ln_pe_1_w, ln_pe_1_b);
    LD_LN("ln2_1",   ln2_1_w,   ln2_1_b);
    LD_LN_KV("ln2_2",   ln2_2_w,   ln2_2_b);
    LD_LN_KV("ln_pe_2", ln_pe_2_w, ln_pe_2_b);
    LD_LN("ln3",     ln3_w,     ln3_b);

    /* Self-attn: q/k/v 1024→512, proj 512→1024. */
    LD_PROJ("self_attn.q_proj", sa_q_w, sa_q_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("self_attn.k_proj", sa_k_w, sa_k_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("self_attn.v_proj", sa_v_w, sa_v_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("self_attn.proj", sa_proj_w, sa_proj_b,
            (size_t)SB_DEC_DIM * SB_DEC_PROJ_DIM, SB_DEC_DIM);

    /* Cross-attn: q 1024→512, k/v 1280→512, proj 512→1024. */
    LD_PROJ("cross_attn.q_proj", ca_q_w, ca_q_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("cross_attn.k_proj", ca_k_w, ca_k_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_KV_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("cross_attn.v_proj", ca_v_w, ca_v_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_KV_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("cross_attn.proj", ca_proj_w, ca_proj_b,
            (size_t)SB_DEC_DIM * SB_DEC_PROJ_DIM, SB_DEC_DIM);

    /* FFN: 1024→1024→1024 (ReLU between, per CPU port). */
    LD_PROJ("ffn.layers.0.0", ffn0_w, ffn0_b,
            (size_t)SB_DEC_FFN * SB_DEC_DIM, SB_DEC_FFN);
    LD_PROJ("ffn.layers.1", ffn1_w, ffn1_b,
            (size_t)SB_DEC_DIM * SB_DEC_FFN, SB_DEC_DIM);

    #undef LD_LN
    #undef LD_LN_KV
    #undef LD_PROJ
    return 0;
}

/* Resolve a per-variant safetensors path. Tries
 *   <dir>/sam3d_body_<variant>_<bucket>.safetensors
 * first, then falls back to the legacy unprefixed alias
 *   <dir>/sam3d_body_<bucket>.safetensors
 * (kept for the dinov3 default — matches the slicer in
 * cpu/sam3d_body/convert_ckpt.py). Returns NULL only if neither exists. */
static char *sb_resolve_variant_path(const char *dir, const char *bucket,
                                     hip_sam3d_body_backbone_t backbone,
                                     char *buf, size_t buflen)
{
    const char *tag = (backbone == HIP_SAM3D_BODY_BACKBONE_VITH) ? "vith"
                                                                  : "dinov3";
    snprintf(buf, buflen, "%s/sam3d_body_%s_%s.safetensors", dir, tag, bucket);
    FILE *f = fopen(buf, "rb");
    if (f) { fclose(f); return buf; }
    snprintf(buf, buflen, "%s/sam3d_body_%s.safetensors", dir, bucket);
    f = fopen(buf, "rb");
    if (f) { fclose(f); return buf; }
    return NULL;
}

static int sb_load_decoder(hip_sam3d_body_ctx *c) {
    if (c->dec.loaded) return 0;
    char path[1024];
    if (!sb_resolve_variant_path(c->cfg.safetensors_dir, "decoder",
                                 c->cfg.backbone, path, sizeof(path))) {
        fprintf(stderr, "sam3d_body: cannot find decoder safetensors in %s "
                        "(tried sam3d_body_{vith,dinov3}_decoder + legacy)\n",
                c->cfg.safetensors_dir);
        return -1;
    }
    c->st_dec = safetensors_open(path);
    if (!c->st_dec) {
        fprintf(stderr, "sam3d_body: cannot open %s\n", path);
        return -1;
    }
    if (!sb_resolve_variant_path(c->cfg.safetensors_dir, "mhr_head",
                                 c->cfg.backbone, path, sizeof(path))) {
        fprintf(stderr, "sam3d_body: cannot find mhr_head safetensors in %s\n",
                c->cfg.safetensors_dir);
        return -1;
    }
    c->st_mhr = safetensors_open(path);
    if (!c->st_mhr) {
        fprintf(stderr, "sam3d_body: cannot open %s\n", path);
        return -1;
    }

    sb_dec_w *D = &c->dec;
    const st_context *dec = c->st_dec;
    const st_context *mhr = c->st_mhr;

    /* ray_cond_emb (conv has bias=False, omit). */
    D->ray_cond_conv_w = sb_upload_st_f32(dec, "ray_cond_emb.conv.weight",
                                          (size_t)SB_DEC_KV_DIM * 1379);
    D->ray_cond_norm_w = sb_upload_st_f32(dec, "ray_cond_emb.norm.weight",
                                          SB_DEC_KV_DIM);
    D->ray_cond_norm_b = sb_upload_st_f32(dec, "ray_cond_emb.norm.bias",
                                          SB_DEC_KV_DIM);

    /* Token construction. */
    D->init_to_token_w = sb_upload_st_f32(dec, "init_to_token_mhr.weight",
                                          (size_t)SB_DEC_DIM *
                                          (SB_DEC_NPOSE + SB_DEC_NCAM + SB_DEC_COND));
    D->init_to_token_b = sb_upload_st_f32(dec, "init_to_token_mhr.bias",
                                          SB_DEC_DIM);
    D->prev_to_token_w = sb_upload_st_f32(dec, "prev_to_token_mhr.weight",
                                          (size_t)SB_DEC_DIM *
                                          (SB_DEC_NPOSE + SB_DEC_NCAM));
    D->prev_to_token_b = sb_upload_st_f32(dec, "prev_to_token_mhr.bias",
                                          SB_DEC_DIM);
    D->prompt_to_token_w = sb_upload_st_f32(dec, "prompt_to_token.weight",
                                            (size_t)SB_DEC_DIM * SB_DEC_KV_DIM);
    D->prompt_to_token_b = sb_upload_st_f32(dec, "prompt_to_token.bias",
                                            SB_DEC_DIM);
    D->keypoint_embedding   = sb_upload_st_f32(dec, "keypoint_embedding.weight",
                                               (size_t)SB_DEC_KP * SB_DEC_DIM);
    D->keypoint3d_embedding = sb_upload_st_f32(dec, "keypoint3d_embedding.weight",
                                               (size_t)SB_DEC_KP * SB_DEC_DIM);
    D->hand_box_embedding   = sb_upload_st_f32(dec, "hand_box_embedding.weight",
                                               (size_t)SB_DEC_HAND_TOK * SB_DEC_DIM);
    D->prompt_pe_gauss = sb_upload_st_f32(dec,
        "prompt_encoder.pe_layer.positional_encoding_gaussian_matrix",
        2 * 640);
    D->invalid_point_embed = sb_upload_st_f32(dec,
        "prompt_encoder.invalid_point_embed.weight",
        (size_t)SB_DEC_KV_DIM);

