lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    /* Keypoint-token update path. */
    D->kp_feat_linear_w = sb_upload_st_f32(dec, "keypoint_feat_linear.weight",
                                           (size_t)SB_DEC_DIM * SB_DEC_KV_DIM);
    D->kp_feat_linear_b = sb_upload_st_f32(dec, "keypoint_feat_linear.bias",
                                           SB_DEC_DIM);
    D->kp_posemb_l0_w = sb_upload_st_f32(dec,
        "keypoint_posemb_linear.layers.0.0.weight", (size_t)SB_DEC_DIM * 2);
    D->kp_posemb_l0_b = sb_upload_st_f32(dec,
        "keypoint_posemb_linear.layers.0.0.bias",   SB_DEC_DIM);
    D->kp_posemb_l1_w = sb_upload_st_f32(dec,
        "keypoint_posemb_linear.layers.1.weight",   (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->kp_posemb_l1_b = sb_upload_st_f32(dec,
        "keypoint_posemb_linear.layers.1.bias",     SB_DEC_DIM);
    D->kp3d_posemb_l0_w = sb_upload_st_f32(dec,
        "keypoint3d_posemb_linear.layers.0.0.weight", (size_t)SB_DEC_DIM * 3);
    D->kp3d_posemb_l0_b = sb_upload_st_f32(dec,
        "keypoint3d_posemb_linear.layers.0.0.bias",   SB_DEC_DIM);
    D->kp3d_posemb_l1_w = sb_upload_st_f32(dec,
        "keypoint3d_posemb_linear.layers.1.weight",   (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->kp3d_posemb_l1_b = sb_upload_st_f32(dec,
        "keypoint3d_posemb_linear.layers.1.bias",     SB_DEC_DIM);

    if (!D->ray_cond_conv_w || !D->ray_cond_norm_w || !D->ray_cond_norm_b ||
        !D->init_to_token_w || !D->init_to_token_b ||
        !D->prev_to_token_w || !D->prev_to_token_b ||
        !D->prompt_to_token_w || !D->prompt_to_token_b ||
        !D->keypoint_embedding || !D->keypoint3d_embedding ||
        !D->hand_box_embedding ||
        !D->prompt_pe_gauss || !D->invalid_point_embed ||
        !D->kp_feat_linear_w || !D->kp_feat_linear_b ||
        !D->kp_posemb_l0_w || !D->kp_posemb_l0_b ||
        !D->kp_posemb_l1_w || !D->kp_posemb_l1_b ||
        !D->kp3d_posemb_l0_w || !D->kp3d_posemb_l0_b ||
        !D->kp3d_posemb_l1_w || !D->kp3d_posemb_l1_b)
        return -1;

    for (int li = 0; li < SB_DEC_LAYERS; li++) {
        if (sb_load_dec_layer(c, li) < 0) {
            fprintf(stderr, "sam3d_body: decoder layer %d load failed\n", li);
            return -1;
        }
    }

    D->norm_final_w = sb_upload_st_f32(dec, "decoder.norm_final.weight",
                                       SB_DEC_DIM);
    D->norm_final_b = sb_upload_st_f32(dec, "decoder.norm_final.bias",
                                       SB_DEC_DIM);
    if (!D->norm_final_w || !D->norm_final_b) return -1;

    /* MHR head regression (mhr_head safetensors). */
    D->head_pose_l0_w   = sb_upload_st_f32(mhr,
        "head_pose.proj.layers.0.0.weight", (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->head_pose_l0_b   = sb_upload_st_f32(mhr,
        "head_pose.proj.layers.0.0.bias",   SB_DEC_DIM);
    D->head_pose_l1_w   = sb_upload_st_f32(mhr,
        "head_pose.proj.layers.1.weight",   (size_t)SB_DEC_NPOSE * SB_DEC_DIM);
    D->head_pose_l1_b   = sb_upload_st_f32(mhr,
        "head_pose.proj.layers.1.bias",     SB_DEC_NPOSE);
    D->head_camera_l0_w = sb_upload_st_f32(mhr,
        "head_camera.proj.layers.0.0.weight", (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->head_camera_l0_b = sb_upload_st_f32(mhr,
        "head_camera.proj.layers.0.0.bias",   SB_DEC_DIM);
    D->head_camera_l1_w = sb_upload_st_f32(mhr,
        "head_camera.proj.layers.1.weight",   (size_t)SB_DEC_NCAM * SB_DEC_DIM);
    D->head_camera_l1_b = sb_upload_st_f32(mhr,
        "head_camera.proj.layers.1.bias",     SB_DEC_NCAM);
    D->init_pose   = sb_upload_st_f32(mhr, "init_pose.weight",   SB_DEC_NPOSE);
    D->init_camera = sb_upload_st_f32(mhr, "init_camera.weight", SB_DEC_NCAM);

    if (!D->head_pose_l0_w || !D->head_pose_l0_b ||
        !D->head_pose_l1_w || !D->head_pose_l1_b ||
        !D->head_camera_l0_w || !D->head_camera_l0_b ||
        !D->head_camera_l1_w || !D->head_camera_l1_b ||
        !D->init_pose || !D->init_camera)
        return -1;

    /* Host (mmap-backed) views of the same tensors for the CPU
     * norm_and_heads tail. */
    D->norm_final_w_h = sb_host_st_f32(dec, "decoder.norm_final.weight",
                                       SB_DEC_DIM);
    D->norm_final_b_h = sb_host_st_f32(dec, "decoder.norm_final.bias",
                                       SB_DEC_DIM);
    D->head_pose_l0_w_h = sb_host_st_f32(mhr,
        "head_pose.proj.layers.0.0.weight", (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->head_pose_l0_b_h = sb_host_st_f32(mhr,
        "head_pose.proj.layers.0.0.bias",   SB_DEC_DIM);
    D->head_pose_l1_w_h = sb_host_st_f32(mhr,
        "head_pose.proj.layers.1.weight",   (size_t)SB_DEC_NPOSE * SB_DEC_DIM);
    D->head_pose_l1_b_h = sb_host_st_f32(mhr,
        "head_pose.proj.layers.1.bias",     SB_DEC_NPOSE);
    D->head_camera_l0_w_h = sb_host_st_f32(mhr,
        "head_camera.proj.layers.0.0.weight", (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->head_camera_l0_b_h = sb_host_st_f32(mhr,
        "head_camera.proj.layers.0.0.bias",   SB_DEC_DIM);
    D->head_camera_l1_w_h = sb_host_st_f32(mhr,
        "head_camera.proj.layers.1.weight",   (size_t)SB_DEC_NCAM * SB_DEC_DIM);
    D->head_camera_l1_b_h = sb_host_st_f32(mhr,
        "head_camera.proj.layers.1.bias",     SB_DEC_NCAM);
    if (!D->norm_final_w_h || !D->norm_final_b_h ||
        !D->head_pose_l0_w_h || !D->head_pose_l0_b_h ||
        !D->head_pose_l1_w_h || !D->head_pose_l1_b_h ||
        !D->head_camera_l0_w_h || !D->head_camera_l0_b_h ||
        !D->head_camera_l1_w_h || !D->head_camera_l1_b_h)
        return -1;

    /* MHR-head decode tables. */
    D->scale_mean       = sb_upload_st_f32(mhr, "head_pose.scale_mean",      68);
    D->scale_comps      = sb_upload_st_f32(mhr, "head_pose.scale_comps",     28 * 68);
    D->hand_pose_mean   = sb_upload_st_f32(mhr, "head_pose.hand_pose_mean",  54);
    D->hand_pose_comps  = sb_upload_st_f32(mhr, "head_pose.hand_pose_comps", 54 * 54);
    D->hand_idx_left    = sb_upload_st_i64(mhr, "head_pose.hand_joint_idxs_left",  27);
    D->hand_idx_right   = sb_upload_st_i64(mhr, "head_pose.hand_joint_idxs_right", 27);
    D->keypoint_mapping = sb_upload_st_f32(mhr, "head_pose.keypoint_mapping",
                                           (size_t)308 * 18566);
    D->local_to_world_wrist = sb_upload_st_f32(mhr,
        "head_pose.local_to_world_wrist", 3 * 3);
    D->right_wrist_coords   = sb_upload_st_f32(mhr,
        "head_pose.right_wrist_coords",   3);
    D->root_coords          = sb_upload_st_f32(mhr,
        "head_pose.root_coords",          3);
    D->nonhand_param_idxs   = sb_upload_st_i64(mhr,
        "head_pose.nonhand_param_idxs",   145);

    if (!D->scale_mean || !D->scale_comps ||
        !D->hand_pose_mean || !D->hand_pose_comps ||
        !D->hand_idx_left || !D->hand_idx_right ||
        !D->keypoint_mapping || !D->local_to_world_wrist ||
        !D->right_wrist_coords || !D->root_coords ||
        !D->nonhand_param_idxs)
        return -1;

