lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    /* faces stays on host — used by OBJ writer + ctx->faces. */
    {
        int fi = safetensors_find((st_context *)mhr, "head_pose.faces");
        if (fi < 0 ||
            strcmp(safetensors_dtype((st_context *)mhr, fi), "I64") != 0) {
            fprintf(stderr, "sam3d_body: head_pose.faces missing or not I64\n");
            return -1;
        }
        size_t nb = safetensors_nbytes((st_context *)mhr, fi);
        size_t nf = nb / (sizeof(int64_t) * 3);
        D->host_faces_i64 = (int64_t *)malloc(nb);
        if (!D->host_faces_i64) return -1;
        memcpy(D->host_faces_i64,
               safetensors_data((st_context *)mhr, fi), nb);
        D->n_faces = (int)nf;
    }

    D->loaded = 1;
    if (c->verbose >= 1)
        fprintf(stderr, "sam3d_body: decoder + MHR-head loaded "
                        "(6 layers, 145-token body branch, %d faces)\n",
                D->n_faces);
    return 0;
}

static int sb_compile(hip_sam3d_body_ctx *c) {
    size_t la = strlen(hip_kernels_common_src);
    size_t lb = strlen(hip_sam3d_body_kernels_src);
    char *src = (char *)malloc(la + lb + 1);
    if (!src) return -1;
    memcpy(src, hip_kernels_common_src, la);
    memcpy(src + la, hip_sam3d_body_kernels_src, lb + 1);
    int rc = hip_compile_kernels(&c->mod, c->device_id, src,
                                 "sam3d_body_kernels", c->verbose, "sam3d_body");
    free(src);
    if (rc < 0) return -1;
    c->sm = rc;
    #define BIND(field, name) do { \
        if (hipModuleGetFunction(&c->field, c->mod, name) != hipSuccess) { \
            fprintf(stderr, "sam3d_body: missing kernel %s\n", name); \
            return -1; \
        } \
    } while (0)
    BIND(fn_sentinel, "sam3d_body_sentinel");
    BIND(fn_resize,   "resize_normalize");
    BIND(fn_patch,    "patch_embed_sam3d");
    BIND(fn_prepend,  "prepend_special_tokens");
    BIND(fn_bf16_round,     "bf16_round_inplace_f32");
    BIND(fn_ln,             "layernorm_f32");
    BIND(fn_gemm_tiled,     "gemm_tiled_f16_f32");
    /* Opt-in BF16-WMMA encoder GEMM; gfx12-only, soft (NULL -> scalar fallback). */
    if (hipModuleGetFunction(&c->fn_gemm_wmma, c->mod, "gemm_f16w_bf16a_wmma_t") != hipSuccess)
        c->fn_gemm_wmma = NULL;
    /* Opt-in BF16-WMMA flash-attention (head_dim=64); gfx12-only, soft. */
    if (hipModuleGetFunction(&c->fn_fa_wmma, c->mod, "flash_attn_tiled_wmma_f32") != hipSuccess)
        c->fn_fa_wmma = NULL;
    BIND(fn_rope_qk,        "rope_apply_qk_rh_sam3d");
    BIND(fn_kv_tx,          "kv_transpose");
    BIND(fn_fa,             "flash_attn_tiled_f32");
    BIND(fn_silu_mul,       "silu_mul_f32");
    BIND(fn_layerscale_add, "layerscale_add_f32");
    BIND(fn_ray_cond_fourier, "ray_cond_fourier_chw_f32");
    BIND(fn_conv1x1_chw,      "conv1x1_chw_f32");
    BIND(fn_ln_chw,           "layernorm_chw_f32");
    BIND(fn_linear_bias,      "linear_f32_bias");
    BIND(fn_gemm_f32,         "gemm_f32_bias");
    BIND(fn_add_two,          "add_two_f32");
    BIND(fn_add_inplace,      "add_inplace_f32");
    BIND(fn_gelu_inplace,     "gelu_inplace_f32");
    BIND(fn_sdpa,             "sdpa_f32");
    BIND(fn_relu_inplace,     "relu_inplace_f32");
    BIND(fn_grid_sample,      "grid_sample_chw_f32");
    BIND(fn_kp_pelvis_norm,   "kp_pelvis_norm_f32");
    BIND(fn_augment_overwrite_mask, "augment_overwrite_with_mask_f32");
    BIND(fn_patch_pad2,     "patch_embed_pad2_f32");
    BIND(fn_pos_embed_vith, "pos_embed_add_vith_f32");
    BIND(fn_qkv_split,      "qkv_split_f32");
    BIND(fn_mhr_blend,      "mhr_blend_combine_f32");
    BIND(fn_mhr_lbs,        "mhr_lbs_skin_f32");
    #undef BIND
    return 0;
}

static int sb_launch(hipFunction_t fn, unsigned gx, unsigned gy, unsigned gz,
                     unsigned bx, unsigned by, unsigned bz,
                     unsigned shmem, void *p, size_t pb) {
    void *cfg[] = { HIP_LAUNCH_PARAM_BUFFER_POINTER, p,
                    HIP_LAUNCH_PARAM_BUFFER_SIZE,    &pb,
                    HIP_LAUNCH_PARAM_END };
    hipError_t e = hipModuleLaunchKernel(fn, gx, gy, gz, bx, by, bz, shmem, 0, NULL, cfg);
    if (e != hipSuccess) {
        fprintf(stderr, "sam3d_body: launch err=%d grid=%ux%ux%u block=%ux%ux%u\n",
                (int)e, gx, gy, gz, bx, by, bz);
        return -1;
    }
    return 0;
}

/* Opt-in BF16-WMMA encoder GEMM dispatch (SAM3D_GEMM_WMMA=1, default OFF).
 * gemm_tiled_f16_f32 and gemm_f16w_bf16a_wmma_t share the packed param
 * layout {void*Y,W,X,bias; int n_out,n_in,n_tok}; only launch geometry
 * differs. Reads n_out/n_in/n_tok from the param buffer and picks. */
static int sb_use_gemm_wmma(void) {
    static int cached = -1;
    if (cached < 0) {
        const char *e = getenv("SAM3D_GEMM_WMMA");
        cached = (e && *e && e[0] != '0') ? 1 : 0;
    }
    return cached;
}
static int sb_use_fa_wmma(void) {
    static int cached = -1;
    if (cached < 0) {
        const char *e = getenv("SAM3D_FA_WMMA");
        cached = (e && *e && e[0] != '0') ? 1 : 0;
    }
    return cached;
}

/* GPU offload for the MHR pose_correctives dense matvec (the 166M-FMA hot path):
 * out[55317] = LW[55317,3000] @ h[3000]  (bias-free), run as gemm_f32_bias with
 * N=1, D_in=3000, D_out=55317 and b=NULL on the resident LW. Installed as
 * cpu_mhr->pc_matvec_fn when SAM3D_MHR_GPU=1. `user` is the ctx. */
static int sb_pc_matvec_gpu(void *user, const float *h, float *out_offsets) {
    hip_sam3d_body_ctx *c = (hip_sam3d_body_ctx *)user;
    int dbg = getenv("SAM3D_MHR_GPU_DEBUG") ? 1 : 0;
    double t0 = dbg ? sb_time_ms() : 0.0;
    const int HID = S3DM_N_PC_H;       /* 3000  */
    const int OUT = S3DM_N_VERTS * 3;  /* 55317 */
    if (hipMemcpy(c->d_pc_h, h, (size_t)HID * sizeof(float),
                  hipMemcpyHostToDevice) != hipSuccess) return -1;
    if (c->fn_mhr_pc_matvec) {
        /* memory-bound GEMV (one block/row, ~600 GB/s) — ~8× the N=1
         * gemm_f32_bias kernel which wastes 15/16 lanes per 16x16 block. */
        int hid = HID, out = OUT;
        struct __attribute__((packed)) {
            void *Y; const void *h; const void *W; int HID, OUT;
        } p = { c->d_pc_out, c->d_pc_h, c->d_pc_lw, hid, out };
        if (sb_launch(c->fn_mhr_pc_matvec, (unsigned)OUT, 1, 1, 64, 1, 1,
                      0, &p, sizeof(p)) < 0)
            return -1;
    } else {
        void *nb = NULL;
        struct __attribute__((packed)) {
            void *Y; const void *X; const void *W; const void *b; int N, D_in, D_out;
        } p = { c->d_pc_out, c->d_pc_h, c->d_pc_lw, nb, 1, HID, OUT };
        unsigned bx = 16, by = 16;
        unsigned gx = (unsigned)((1   + bx - 1) / bx);
        unsigned gy = (unsigned)((OUT + by - 1) / by);
        if (sb_launch(c->fn_gemm_f32, gx, gy, 1, bx, by, 1, 0, &p, sizeof(p)) < 0)
            return -1;
    }
    if (hipMemcpy(out_offsets, c->d_pc_out, (size_t)OUT * sizeof(float),
                  hipMemcpyDeviceToHost) != hipSuccess) return -1;
    if (dbg) {
        static int n = 0; static double tot = 0.0;
        double dt = sb_time_ms() - t0; tot += dt;
        fprintf(stderr, "[sb_pc_matvec_gpu] call #%d %.3f ms (cumulative %.3f, kernel=%s)\n",
                ++n, dt, tot, c->fn_mhr_pc_matvec ? "matvec" : "gemm");
    }
    return 0;
}

/* Upload LW resident and install the GPU matvec hook on cpu_mhr.
 * No-op unless SAM3D_MHR_GPU=1 and pc_linear_weight is loaded. */
static int sb_mhr_gpu_setup(hip_sam3d_body_ctx *c) {
    if (!c->cpu_mhr) return 0;
    const char *e = getenv("SAM3D_MHR_GPU");
    if (!(e && *e && e[0] != '0')) return 0;
    const int HID = S3DM_N_PC_H, OUT = S3DM_N_VERTS * 3;
    const float *LW = (const float *)c->cpu_mhr->pc_linear_weight.data;
    if (!LW) {
        fprintf(stderr, "sam3d_body: SAM3D_MHR_GPU set but pc_linear_weight missing — staying on CPU\n");
        return 0;
    }
    /* LW is 633 MiB resident. Only engage if there's headroom for it AND the
     * rest of the pipeline (encoder/decoder buffers, ~1 GiB) — otherwise the
     * downstream allocs OOM mid-run. Stay on CPU (correct, just slower) if not. */
    size_t need = (size_t)OUT * HID * sizeof(float);
    size_t headroom = 1024ull * 1024 * 1024;  /* ~1 GiB for pipeline buffers */
    size_t freeb = 0, totb = 0;
    if (hipMemGetInfo(&freeb, &totb) != hipSuccess) return 0;
    if (freeb < need + headroom) {
        fprintf(stderr, "sam3d_body: SAM3D_MHR_GPU set but only %.0f MiB free "
                "(need %.0f + ~1024 headroom) — staying on CPU\n",
                freeb / 1048576.0, need / 1048576.0);
        return 0;
    }
    if (hipMalloc(&c->d_pc_lw,  (size_t)OUT * HID * sizeof(float)) != hipSuccess) return -1;
    if (hipMalloc(&c->d_pc_h,   (size_t)HID * sizeof(float)) != hipSuccess) return -1;
    if (hipMalloc(&c->d_pc_out, (size_t)OUT * sizeof(float)) != hipSuccess) return -1;
    if (hipMemcpy(c->d_pc_lw, LW, (size_t)OUT * HID * sizeof(float),
                  hipMemcpyHostToDevice) != hipSuccess) return -1;
    /* Optimized GEMV kernel; soft (NULL → sb_pc_matvec_gpu uses gemm_f32_bias). */
    if (hipModuleGetFunction(&c->fn_mhr_pc_matvec, c->mod, "mhr_pc_matvec_f32") != hipSuccess)
        c->fn_mhr_pc_matvec = NULL;
    c->cpu_mhr->pc_matvec_user = c;
    c->cpu_mhr->pc_matvec_fn = sb_pc_matvec_gpu;
    c->mhr_gpu_pc = 1;
    if (c->verbose)
        fprintf(stderr, "sam3d_body: MHR pose_correctives matvec on GPU "
                "(LW %.0f MiB resident, kernel=%s)\n", (double)OUT * HID * 4 / 1048576.0,
                c->fn_mhr_pc_matvec ? "mhr_pc_matvec_f32" : "gemm_f32_bias");
    return 0;
}
static int sb_gemm_tiled(hip_sam3d_body_ctx *c, void *p, size_t pb) {
    const unsigned char *pp = (const unsigned char *)p;
    int n_out, n_in, n_tok;
    memcpy(&n_out, pp + 4 * sizeof(void *) + 0, 4);
    memcpy(&n_in,  pp + 4 * sizeof(void *) + 4, 4);
    memcpy(&n_tok, pp + 4 * sizeof(void *) + 8, 4);
    if (getenv("SAM3D_GEMM_WMMA_DEBUG")) {
        static int once = 0;
        if (!once) { once = 1;
            fprintf(stderr, "[sb_gemm_tiled] use_wmma=%d fn=%p n_in=%d -> %s\n",
                    sb_use_gemm_wmma(), (void *)c->fn_gemm_wmma, n_in,
                    (sb_use_gemm_wmma() && c->fn_gemm_wmma && (n_in % 16 == 0)) ? "WMMA" : "scalar"); }
    }
    if (sb_use_gemm_wmma() && c->fn_gemm_wmma && (n_in % 16 == 0))
        return sb_launch(c->fn_gemm_wmma, (unsigned)((n_out + 127) / 128),
                         (unsigned)((n_tok + 127) / 128), 1, 256, 1, 1, 0, p, pb);
    return sb_launch(c->fn_gemm_tiled, (unsigned)((n_out + 63) / 64),
                     (unsigned)((n_tok + 15) / 16), 1, 16, 16, 1, 0, p, pb);
}

static int sb_precision_is_bf16(const hip_sam3d_body_ctx *ctx)
{
    const char *p = ctx && ctx->cfg.precision ? ctx->cfg.precision : NULL;
    return !p || !p[0] || !strcmp(p, "bf16");
}

static int sb_precision_is_supported(const char *p)
{
    return !p || !p[0] || !strcmp(p, "bf16") || !strcmp(p, "fp16");
}

static int sb_bf16_round(hip_sam3d_body_ctx *ctx, void *x, int n)
{
    if (!sb_precision_is_bf16(ctx) || !x || n <= 0) return 0;
    struct __attribute__((packed)) {
        void *x; int n;
    } p = { x, n };
    return sb_launch(ctx->fn_bf16_round, (unsigned)((n + 255) / 256), 1, 1,
                     256, 1, 1, 0, &p, sizeof(p));
}

/* ===================== public API ===================== */

hip_sam3d_body_ctx *hip_sam3d_body_create(const hip_sam3d_body_config *cfg)
{
    if (!cfg || !cfg->safetensors_dir) return NULL;
    if (!sb_precision_is_supported(cfg->precision)) {
        fprintf(stderr, "sam3d_body: unsupported precision '%s' (expected bf16 or fp16)\n",
                cfg->precision);
        return NULL;
    }

