lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    c->weights_ready = 1;
    if (c->verbose >= 1)
        fprintf(stderr, "sam3d_body: encoder weights uploaded "
                        "(%d blocks, D=%d, FFN=%d, sm_%d)\n",
                SB_N_BLK, SB_DIM, SB_FFN, c->sm);

load_decoder_and_mhr:
    /* Decoder + MHR-head safetensors. */
    if (sb_load_decoder(c) < 0) {
        fprintf(stderr, "sam3d_body: decoder load failed\n");
        hip_sam3d_body_destroy(c); return NULL;
    }

    /* CPU model + MHR assets for the run_decoder MHR-in-the-loop path.
     * These are optional — verify_*.c binaries that don't need a full
     * end-to-end forward (verify_dinov3, verify_ray_cond, etc.) leave
     * mhr_assets_dir NULL and the loaders are skipped. */
    {
        char p1[1024], p2[1024];
        if (!sb_resolve_variant_path(cfg->safetensors_dir, "decoder",
                                     cfg->backbone, p1, sizeof(p1)) ||
            !sb_resolve_variant_path(cfg->safetensors_dir, "mhr_head",
                                     cfg->backbone, p2, sizeof(p2))) {
            fprintf(stderr, "sam3d_body: variant safetensors missing in %s\n",
                    cfg->safetensors_dir);
            hip_sam3d_body_destroy(c); return NULL;
        }
        c->cpu_dec = sam3d_body_decoder_load(p1, p2);
        if (!c->cpu_dec) {
            fprintf(stderr, "sam3d_body: CPU decoder_load failed (%s, %s)\n",
                    p1, p2);
            hip_sam3d_body_destroy(c); return NULL;
        }

        if (cfg->mhr_assets_dir) {
            snprintf(p1, sizeof(p1), "%s/sam3d_body_mhr_jit.safetensors",
                     cfg->mhr_assets_dir);
            snprintf(p2, sizeof(p2), "%s/sam3d_body_mhr_jit.json",
                     cfg->mhr_assets_dir);
            c->cpu_mhr = sam3d_body_mhr_load(p1, p2);
            if (!c->cpu_mhr) {
                fprintf(stderr, "sam3d_body: MHR asset load failed (%s, %s)\n",
                        p1, p2);
                hip_sam3d_body_destroy(c); return NULL;
            }
        }
    }

    return c;
}

static void sb_free_dev(void *p) { if (p) hipFree(p); }

void hip_sam3d_body_destroy(hip_sam3d_body_ctx *ctx)
{
    if (!ctx) return;
    sb_free_dev(ctx->w_patch_w); sb_free_dev(ctx->w_patch_b);
    sb_free_dev(ctx->w_cls); sb_free_dev(ctx->w_storage);
    sb_free_dev(ctx->w_rope_periods);
    sb_free_dev(ctx->w_rope_cos); sb_free_dev(ctx->w_rope_sin);
    sb_free_dev(ctx->w_norm_w); sb_free_dev(ctx->w_norm_b);
    sb_free_dev(ctx->w_vith_pos_embed);
    for (int i = 0; i < SB_N_BLK; i++) {
        sb_block *b = &ctx->blk[i];
        sb_free_dev(b->norm1_w); sb_free_dev(b->norm1_b);
        sb_free_dev(b->norm2_w); sb_free_dev(b->norm2_b);
        sb_free_dev(b->qkv_w);   sb_free_dev(b->qkv_b);
        sb_free_dev(b->proj_w);  sb_free_dev(b->proj_b);
        sb_free_dev(b->ls1);     sb_free_dev(b->ls2);
        sb_free_dev(b->w1_w);    sb_free_dev(b->w1_b);
        sb_free_dev(b->w2_w);    sb_free_dev(b->w2_b);
        sb_free_dev(b->w3_w);    sb_free_dev(b->w3_b);
    }
    for (int i = 0; i < SB_VITH_N_BLK; i++) {
        sb_block_vith *b = &ctx->vith_blk[i];
        sb_free_dev(b->norm1_w); sb_free_dev(b->norm1_b);
        sb_free_dev(b->norm2_w); sb_free_dev(b->norm2_b);
        sb_free_dev(b->qkv_w);   sb_free_dev(b->qkv_b);
        sb_free_dev(b->proj_w);  sb_free_dev(b->proj_b);
        sb_free_dev(b->fc1_w);   sb_free_dev(b->fc1_b);
        sb_free_dev(b->fc2_w);   sb_free_dev(b->fc2_b);
    }
    sb_free_dev(ctx->d_img_u8);
    sb_free_dev(ctx->d_img_f32);
    sb_free_dev(ctx->d_tok);
    sb_free_dev(ctx->d_ln);
    sb_free_dev(ctx->d_qkv);
    sb_free_dev(ctx->d_kt);
    sb_free_dev(ctx->d_vt);
    sb_free_dev(ctx->d_attn);
    sb_free_dev(ctx->d_proj);
    sb_free_dev(ctx->d_gate);
    sb_free_dev(ctx->d_up);
    /* Decoder + MHR-head weights. */
    sb_dec_w *D = &ctx->dec;
    sb_free_dev(D->ray_cond_conv_w);
    sb_free_dev(D->ray_cond_norm_w); sb_free_dev(D->ray_cond_norm_b);
    sb_free_dev(D->init_to_token_w); sb_free_dev(D->init_to_token_b);
    sb_free_dev(D->prev_to_token_w); sb_free_dev(D->prev_to_token_b);
    sb_free_dev(D->prompt_to_token_w); sb_free_dev(D->prompt_to_token_b);
    sb_free_dev(D->keypoint_embedding);
    sb_free_dev(D->keypoint3d_embedding);
    sb_free_dev(D->hand_box_embedding);
    sb_free_dev(D->kp_feat_linear_w); sb_free_dev(D->kp_feat_linear_b);
    sb_free_dev(D->kp_posemb_l0_w); sb_free_dev(D->kp_posemb_l0_b);
    sb_free_dev(D->kp_posemb_l1_w); sb_free_dev(D->kp_posemb_l1_b);
    sb_free_dev(D->kp3d_posemb_l0_w); sb_free_dev(D->kp3d_posemb_l0_b);
    sb_free_dev(D->kp3d_posemb_l1_w); sb_free_dev(D->kp3d_posemb_l1_b);
    sb_free_dev(D->prompt_pe_gauss);
    sb_free_dev(D->invalid_point_embed);
    for (int li = 0; li < SB_DEC_LAYERS; li++) {
        sb_dec_layer_w *L = &D->layers[li];
        sb_free_dev(L->ln1_w); sb_free_dev(L->ln1_b);
        sb_free_dev(L->ln_pe_1_w); sb_free_dev(L->ln_pe_1_b);
        sb_free_dev(L->ln2_1_w); sb_free_dev(L->ln2_1_b);
        sb_free_dev(L->ln2_2_w); sb_free_dev(L->ln2_2_b);
        sb_free_dev(L->ln_pe_2_w); sb_free_dev(L->ln_pe_2_b);
        sb_free_dev(L->ln3_w); sb_free_dev(L->ln3_b);
        sb_free_dev(L->sa_q_w); sb_free_dev(L->sa_q_b);
        sb_free_dev(L->sa_k_w); sb_free_dev(L->sa_k_b);
        sb_free_dev(L->sa_v_w); sb_free_dev(L->sa_v_b);
        sb_free_dev(L->sa_proj_w); sb_free_dev(L->sa_proj_b);
        sb_free_dev(L->ca_q_w); sb_free_dev(L->ca_q_b);
        sb_free_dev(L->ca_k_w); sb_free_dev(L->ca_k_b);
        sb_free_dev(L->ca_v_w); sb_free_dev(L->ca_v_b);
        sb_free_dev(L->ca_proj_w); sb_free_dev(L->ca_proj_b);
        sb_free_dev(L->ffn0_w); sb_free_dev(L->ffn0_b);
        sb_free_dev(L->ffn1_w); sb_free_dev(L->ffn1_b);
    }
    sb_free_dev(D->norm_final_w); sb_free_dev(D->norm_final_b);
    sb_free_dev(D->head_pose_l0_w); sb_free_dev(D->head_pose_l0_b);
    sb_free_dev(D->head_pose_l1_w); sb_free_dev(D->head_pose_l1_b);
    sb_free_dev(D->head_camera_l0_w); sb_free_dev(D->head_camera_l0_b);
    sb_free_dev(D->head_camera_l1_w); sb_free_dev(D->head_camera_l1_b);
    sb_free_dev(D->init_pose); sb_free_dev(D->init_camera);
    sb_free_dev(D->scale_mean); sb_free_dev(D->scale_comps);
    sb_free_dev(D->hand_pose_mean); sb_free_dev(D->hand_pose_comps);
    sb_free_dev(D->hand_idx_left); sb_free_dev(D->hand_idx_right);
    sb_free_dev(D->keypoint_mapping);
    sb_free_dev(D->local_to_world_wrist);
    sb_free_dev(D->right_wrist_coords);
    sb_free_dev(D->root_coords);
    sb_free_dev(D->nonhand_param_idxs);
    free(D->host_faces_i64);
    if (ctx->mod) hipModuleUnload(ctx->mod);
    if (ctx->st_enc) safetensors_close(ctx->st_enc);
    if (ctx->st_dec) safetensors_close(ctx->st_dec);
    if (ctx->st_mhr) safetensors_close(ctx->st_mhr);
    if (ctx->cpu_dec) sam3d_body_decoder_free(ctx->cpu_dec);
    if (ctx->cpu_mhr) sam3d_body_mhr_free(ctx->cpu_mhr);
    free(ctx->image_rgb);
    free(ctx->encoder_tokens.data);
    free(ctx->mhr_params);
    free(ctx->vertices);
    free(ctx->faces);
    free(ctx->keypoints_3d);
    free(ctx->keypoints_2d);
    free(ctx);
}

int hip_sam3d_body_set_image(hip_sam3d_body_ctx *ctx, const uint8_t *rgb,
                              int width, int height, const float bbox[4])
{
    if (!ctx || !rgb || width <= 0 || height <= 0) return HIP_SAM3D_BODY_E_INVAL;
    size_t bytes = (size_t)width * height * 3;
    free(ctx->image_rgb);
    ctx->image_rgb = (uint8_t *)malloc(bytes);
    if (!ctx->image_rgb) return HIP_SAM3D_BODY_E_INVAL;
    memcpy(ctx->image_rgb, rgb, bytes);
    ctx->img_w = width; ctx->img_h = height;
    ctx->has_bbox = 0;
    if (bbox) { memcpy(ctx->bbox, bbox, sizeof(ctx->bbox)); ctx->has_bbox = 1; }
    return HIP_SAM3D_BODY_E_OK;
}

int hip_sam3d_body_set_focal(hip_sam3d_body_ctx *ctx, float f)
{
    if (!ctx) return HIP_SAM3D_BODY_E_INVAL;
    ctx->focal_hint = f;
    return HIP_SAM3D_BODY_E_OK;
}

/* ViT-H/16 (vit_hmr_512_384) encoder forward.
 *
 * Pipeline:
 *   patch_embed_pad2 → pos_embed_add_vith
 *   for L in 32 blocks:
 *     LN1 → QKV gemm → qkv_split → sdpa_f32 → proj gemm → residual_add
 *     LN2 → fc1 gemm → GELU → fc2 gemm → residual_add
 *   last_norm → host readback (768, 1280)
 *
 * No CLS/storage tokens, no RoPE, no LayerScale. Forward in fp32 with
 * f16 weights (matches DINOv3 path).
 *
 * Buffer reuse:
 *   d_tok   (N, D)   residual stream
 *   d_ln    (N, D)   LN scratch
 *   d_qkv   (N, 3D)  fused QKV
 *   d_kt    (N, D)   Q packed (reuse — sdpa needs (N, H*D_h)=(N, D))
 *   d_vt    (N, D)   K packed
 *   d_attn  (N, D)   V packed (reused as sdpa scratch, then attn output)
 *                    -- actually V needs to live through sdpa, so we use
 *                    -- d_proj for V and write sdpa output to d_attn.
 *   d_proj  (N, D)   V packed AND post-proj scratch (V is consumed by sdpa
 *                    before proj runs — safe to reuse).
 *   d_gate  (N, FFN) FFN intermediate (fc1 out → GELU → fc2 in).
 */
static int hip_sam3d_body_run_encoder_vith(hip_sam3d_body_ctx *ctx)
{
    const int IMG_H   = SB_VITH_IMG_H;
    const int IMG_W   = SB_VITH_IMG_W;
    const int GW      = SB_VITH_GRID_W;
    const int GH      = SB_VITH_GRID_H;
    const int N_TOK   = SB_VITH_N_PATCH;
    const int D       = SB_VITH_DIM;
    const int FFN     = SB_VITH_FFN;
    const int HEADS   = SB_VITH_HEADS;
    const int HEAD_DIM = SB_VITH_HEAD_DIM;

