lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    if (!ctx->has_norm_input) {
        /* Caller (hip_sam3d_body_run_encoder dispatch) is expected to have
         * either run host-side preprocess + upload, or populated d_img_f32
         * via debug_set_normalized_input from verify_vith. */
        fprintf(stderr, "sam3d_body_vith: d_img_f32 not populated\n");
        return HIP_SAM3D_BODY_E_INVAL;
    }

    if (!ctx->d_tok) {
        if (hipMalloc(&ctx->d_tok,
                      (size_t)N_TOK * D * sizeof(float)) != hipSuccess)
            return HIP_SAM3D_BODY_E_LOAD;
    }

    /* patch_embed_pad2 → d_tok rows [0..N_TOK). */
    {
        struct __attribute__((packed)) {
            void *out; const void *img; const void *w; const void *bias;
            int gw, gh, dim, ps, img_h, img_w, pad;
        } p = { ctx->d_tok, ctx->d_img_f32, ctx->w_patch_w, ctx->w_patch_b,
                GW, GH, D, SB_VITH_PATCH, IMG_H, IMG_W, SB_VITH_PAD };
        if (sb_launch(ctx->fn_patch_pad2, (unsigned)N_TOK, 1, 1, 256, 1, 1,
                      0, &p, sizeof(p)) < 0)
            return HIP_SAM3D_BODY_E_LOAD;
    }

    /* pos_embed_add_vith — d_tok += pos[1+t] + pos[0]. */
    {
        struct __attribute__((packed)) {
            void *hidden; const void *pos; int n_patches, dim;
        } p = { ctx->d_tok, ctx->w_vith_pos_embed, N_TOK, D };
        unsigned total = (unsigned)((size_t)N_TOK * D);
        if (sb_launch(ctx->fn_pos_embed_vith, (total + 255) / 256, 1, 1,
                      256, 1, 1, 0, &p, sizeof(p)) < 0)
            return HIP_SAM3D_BODY_E_LOAD;
    }

    /* Allocate per-block scratch on first use. Sizes match ViT-H widths. */
    #define ENSURE(field, bytes) do { \
        if (!ctx->field) { \
            if (hipMalloc(&ctx->field, (bytes)) != hipSuccess) \
                return HIP_SAM3D_BODY_E_LOAD; \
        } \
    } while (0)
    ENSURE(d_ln,   (size_t)N_TOK * D * sizeof(float));
    ENSURE(d_qkv,  (size_t)N_TOK * 3 * D * sizeof(float));
    /* d_kt / d_vt are sized for HEADS*N_TOK*HEAD_DIM = N_TOK*D — reuse
     * them as Q-packed and K-packed (N, D). */
    ENSURE(d_kt,   (size_t)N_TOK * D * sizeof(float));
    ENSURE(d_vt,   (size_t)N_TOK * D * sizeof(float));
    ENSURE(d_attn, (size_t)N_TOK * D * sizeof(float));
    ENSURE(d_proj, (size_t)N_TOK * D * sizeof(float));
    ENSURE(d_gate, (size_t)N_TOK * FFN * sizeof(float));
    #undef ENSURE

    (void)HEADS;
    const float scale = 1.0f / sqrtf((float)HEAD_DIM);

    for (int L = 0; L < SB_VITH_N_BLK; L++) {
        sb_block_vith *b = &ctx->vith_blk[L];

        /* LN1: d_ln <- LN(d_tok). */
        {
            struct __attribute__((packed)) {
                void *dst; const void *src, *w, *bb; int dim; float eps;
            } p = { ctx->d_ln, ctx->d_tok, b->norm1_w, b->norm1_b,
                    D, SB_VITH_LN_EPS };
            if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                          256 * 4, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* QKV: d_qkv <- gemm(qkv_w, d_ln) + qkv_b.  Out cols = 3*D. */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_qkv, b->qkv_w, ctx->d_ln, b->qkv_b,
                    3 * D, D, N_TOK };
            if (sb_gemm_tiled(ctx, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* qkv_split_f32: split d_qkv (N, 3D) into Q=d_kt, K=d_vt, V=d_proj
         * each (N, D) row-major. */
        {
            struct __attribute__((packed)) {
                void *Q, *K, *V; const void *qkv; int n, dim;
            } p = { ctx->d_kt, ctx->d_vt, ctx->d_proj, ctx->d_qkv, N_TOK, D };
            unsigned total = (unsigned)(N_TOK * D);
            if (sb_launch(ctx->fn_qkv_split, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* sdpa_f32: d_attn (N, D) <- softmax(Q K^T * scale) V.
         *   q=d_kt, k=d_vt, v=d_proj — all (N, H*D_h) row-major.
         * Grid: (N_q, H)   Block: (256,)   Shmem: (256 + N_k) * 4. */
        {
            struct __attribute__((packed)) {
                void *out; const void *q, *k, *v;
                int n_q, n_k, h, d_h; float sc;
            } p = { ctx->d_attn, ctx->d_kt, ctx->d_vt, ctx->d_proj,
                    N_TOK, N_TOK, HEADS, HEAD_DIM, scale };
            unsigned shmem = (unsigned)((256 + N_TOK) * sizeof(float));
            if (sb_launch(ctx->fn_sdpa, (unsigned)N_TOK, (unsigned)HEADS, 1,
                          256, 1, 1, shmem, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* proj: d_proj <- gemm(proj_w, d_attn) + proj_b. */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_proj, b->proj_w, ctx->d_attn, b->proj_b,
                    D, D, N_TOK };
            if (sb_gemm_tiled(ctx, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* residual: d_tok += d_proj (no LayerScale for ViT-H). */
        {
            struct __attribute__((packed)) {
                void *a; const void *b; int n;
            } p = { ctx->d_tok, ctx->d_proj, N_TOK * D };
            unsigned total = (unsigned)(N_TOK * D);
            if (sb_launch(ctx->fn_add_inplace, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* LN2: d_ln <- LN(d_tok). */
        {
            struct __attribute__((packed)) {
                void *dst; const void *src, *w, *bb; int dim; float eps;
            } p = { ctx->d_ln, ctx->d_tok, b->norm2_w, b->norm2_b,
                    D, SB_VITH_LN_EPS };
            if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                          256 * 4, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* fc1: d_gate <- gemm(fc1_w, d_ln) + fc1_b.  (N, FFN) */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_gate, b->fc1_w, ctx->d_ln, b->fc1_b,
                    FFN, D, N_TOK };
            if (sb_gemm_tiled(ctx, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* GELU in-place. */
        {
            struct __attribute__((packed)) {
                void *x; int n;
            } p = { ctx->d_gate, N_TOK * FFN };
            unsigned total = (unsigned)(N_TOK * FFN);
            if (sb_launch(ctx->fn_gelu_inplace, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* fc2: d_proj <- gemm(fc2_w, d_gate) + fc2_b.  (N, D) */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_proj, b->fc2_w, ctx->d_gate, b->fc2_b,
                    D, FFN, N_TOK };
            if (sb_gemm_tiled(ctx, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

