lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
        /* residual: d_tok += d_proj. */
        {
            struct __attribute__((packed)) {
                void *a; const void *b; int n;
            } p = { ctx->d_tok, ctx->d_proj, N_TOK * D };
            unsigned total = (unsigned)(N_TOK * D);
            if (sb_launch(ctx->fn_add_inplace, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
    }

    /* last_norm: d_proj <- LN(d_tok, last_norm_w, last_norm_b). */
    {
        struct __attribute__((packed)) {
            void *dst; const void *src, *w, *bb; int dim; float eps;
        } p = { ctx->d_proj, ctx->d_tok, ctx->w_norm_w, ctx->w_norm_b,
                D, SB_VITH_LN_EPS };
        if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                      256 * 4, &p, sizeof(p)) < 0)
            return HIP_SAM3D_BODY_E_LOAD;
    }

    if (hipDeviceSynchronize() != hipSuccess) return HIP_SAM3D_BODY_E_LOAD;

    /* Copy final encoder tokens to host as (N_TOK, D) row-major. */
    free(ctx->encoder_tokens.data);
    ctx->encoder_tokens.data =
        (float *)malloc((size_t)N_TOK * D * sizeof(float));
    if (!ctx->encoder_tokens.data) return HIP_SAM3D_BODY_E_LOAD;
    if (hipMemcpy(ctx->encoder_tokens.data, ctx->d_proj,
                  (size_t)N_TOK * D * sizeof(float),
                  hipMemcpyDeviceToHost) != hipSuccess)
        return HIP_SAM3D_BODY_E_LOAD;
    ctx->encoder_tokens.n = N_TOK;
    ctx->encoder_tokens.c = D;

    if (ctx->verbose >= 1)
        fprintf(stderr, "sam3d_body_vith: encoder forward done "
                        "(%d blocks, N_TOK=%d, D=%d)\n",
                SB_VITH_N_BLK, N_TOK, D);

    return HIP_SAM3D_BODY_E_OK;
}

int hip_sam3d_body_run_encoder(hip_sam3d_body_ctx *ctx)
{
    if (!ctx) return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->weights_ready) return HIP_SAM3D_BODY_E_LOAD;
    if (!ctx->image_rgb && !ctx->has_norm_input)
        return HIP_SAM3D_BODY_E_INVAL;

    const double t_encoder0 = sb_time_ms();

    if (ctx->cfg.backbone == HIP_SAM3D_BODY_BACKBONE_VITH) {
        /* Host-side preprocess for vit_hmr_512_384: TopdownAffine to a
         * 512×512 canvas + ImageNet norm + W-axis crop [:, :, :, 64:-64]
         * → (3, 512, 384). Mirrors the CPU runner. Skipped if the verify
         * path already populated d_img_f32 via debug_set_normalized_input. */
        if (!ctx->has_norm_input) {
            const int S = SB_VITH_IMG_H;        /* 512 */
            const int W_crop = SB_VITH_IMG_W;   /* 384 */
            float bbox_xyxy[4];
            if (ctx->has_bbox) {
                memcpy(bbox_xyxy, ctx->bbox, sizeof(bbox_xyxy));
            } else {
                bbox_xyxy[0] = 0; bbox_xyxy[1] = 0;
                bbox_xyxy[2] = (float)ctx->img_w; bbox_xyxy[3] = (float)ctx->img_h;
            }
            sam3d_body_compute_bbox_affine(bbox_xyxy, /*padding=*/1.25f,
                                           /*aspect_ratio_pre=*/0.75f, S, S,
                                           ctx->self_center, ctx->self_scale,
                                           ctx->self_warp);
            sam3d_body_default_cam_int(ctx->img_w, ctx->img_h, ctx->self_cam_int);
            if (ctx->focal_hint > 0) {
                ctx->self_cam_int[0] = ctx->focal_hint;
                ctx->self_cam_int[4] = ctx->focal_hint;
            }
            ctx->self_pp_set = 1;

            float *chw_full = (float *)malloc((size_t)3 * S * S * sizeof(float));
            if (!chw_full) return HIP_SAM3D_BODY_E_LOAD;
            if (sam3d_body_preprocess_image(ctx->image_rgb, ctx->img_w, ctx->img_h,
                                            ctx->self_warp, S, S, chw_full) != 0) {
                free(chw_full);
                return HIP_SAM3D_BODY_E_LOAD;
            }
            float *chw_crop = (float *)malloc((size_t)3 * S * W_crop * sizeof(float));
            if (!chw_crop) { free(chw_full); return HIP_SAM3D_BODY_E_LOAD; }
            for (int c = 0; c < 3; c++) {
                for (int y = 0; y < S; y++) {
                    const float *src = chw_full + ((size_t)c * S + y) * S + 64;
                    float       *dst = chw_crop + ((size_t)c * S + y) * W_crop;
                    memcpy(dst, src, (size_t)W_crop * sizeof(float));
                }
            }
            free(chw_full);

            size_t bytes = (size_t)3 * S * W_crop * sizeof(float);
            if (!ctx->d_img_f32) {
                if (hipMalloc(&ctx->d_img_f32, bytes) != hipSuccess) {
                    free(chw_crop);
                    return HIP_SAM3D_BODY_E_LOAD;
                }
            }
            if (hipMemcpy(ctx->d_img_f32, chw_crop, bytes,
                          hipMemcpyHostToDevice) != hipSuccess) {
                free(chw_crop);
                return HIP_SAM3D_BODY_E_LOAD;
            }
            free(chw_crop);
            ctx->has_norm_input = 1;
        }
        return hip_sam3d_body_run_encoder_vith(ctx);
    }

    const int IMG = ctx->cfg.image_size;
    const int GW  = IMG / SB_PATCH;
    const int N_PATCH = GW * GW;
    const int N_TOK   = 1 + SB_N_STORAGE + N_PATCH;
    double t_preprocess_ms = 0.0;
    double t_embed_ms = 0.0;
    double t_blocks_ms = 0.0;
    double t_final_norm_ms = 0.0;
    double t_readback_ms = 0.0;

    if (!ctx->d_tok) {
        if (hipMalloc(&ctx->d_tok,
                      (size_t)N_TOK * SB_DIM * sizeof(float)) != hipSuccess)
            return HIP_SAM3D_BODY_E_LOAD;
    }

    if (!ctx->has_norm_input) {
        /* Match the CPU runner's preprocess: TopdownAffine (bbox + 0.75
         * aspect ratio + 1.25 padding) → cv2.warpAffine → ImageNet norm
         * → HWC→CHW. We do this on the host (sam3d_body_preprocess_image)
         * and upload the (3, IMG, IMG) f32 result; on-device naive
         * bilinear resize would feed DINOv3 a stretched image when the
     * input aspect ratio differs from 0.75. */
        const double t0 = sb_time_ms();
        float bbox_xyxy[4];
        if (ctx->has_bbox) {
            memcpy(bbox_xyxy, ctx->bbox, sizeof(bbox_xyxy));
        } else {
            bbox_xyxy[0] = 0; bbox_xyxy[1] = 0;
            bbox_xyxy[2] = (float)ctx->img_w; bbox_xyxy[3] = (float)ctx->img_h;
        }
        sam3d_body_compute_bbox_affine(bbox_xyxy, /*padding=*/1.25f,
                                       /*aspect_ratio_pre=*/0.75f, IMG, IMG,
                                       ctx->self_center, ctx->self_scale,
                                       ctx->self_warp);
        sam3d_body_default_cam_int(ctx->img_w, ctx->img_h, ctx->self_cam_int);
        if (ctx->focal_hint > 0) {
            ctx->self_cam_int[0] = ctx->focal_hint;
            ctx->self_cam_int[4] = ctx->focal_hint;
        }
        ctx->self_pp_set = 1;

        float *chw = (float *)malloc((size_t)3 * IMG * IMG * sizeof(float));
        if (!chw) return HIP_SAM3D_BODY_E_LOAD;
        if (sam3d_body_preprocess_image(ctx->image_rgb, ctx->img_w, ctx->img_h,
                                        ctx->self_warp, IMG, IMG, chw) != 0) {
            free(chw);
            return HIP_SAM3D_BODY_E_LOAD;
        }

        if (!ctx->d_img_f32) {
            if (hipMalloc(&ctx->d_img_f32,
                          (size_t)3 * IMG * IMG * sizeof(float)) != hipSuccess) {
                free(chw);
                return HIP_SAM3D_BODY_E_LOAD;
            }
        }
        if (hipMemcpy(ctx->d_img_f32, chw,
                      (size_t)3 * IMG * IMG * sizeof(float),
                      hipMemcpyHostToDevice) != hipSuccess) {
            free(chw);
            return HIP_SAM3D_BODY_E_LOAD;
        }
        free(chw);
        t_preprocess_ms = sb_time_ms() - t0;
    }

