lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    const double t_embed0 = sb_time_ms();

    /* prepend CLS + 4 storage tokens → rows 0..4 */
    {
        struct __attribute__((packed)) {
            void *out; const void *cls; const void *storage;
            int n_storage, dim;
        } p = { ctx->d_tok, ctx->w_cls, ctx->w_storage, SB_N_STORAGE, SB_DIM };
        unsigned total = (unsigned)((1 + SB_N_STORAGE) * SB_DIM);
        if (sb_launch(ctx->fn_prepend, (total + 255) / 256, 1, 1, 256, 1, 1,
                      0, &p, sizeof(p)) < 0)
            return HIP_SAM3D_BODY_E_LOAD;
    }

    /* patch embed → rows 5..5+1024 */
    {
        struct __attribute__((packed)) {
            void *out; const void *img; const void *w; const void *bias;
            int gw, dim, ps, img_w, base_tok;
        } p = { ctx->d_tok, ctx->d_img_f32, ctx->w_patch_w, ctx->w_patch_b,
                GW, SB_DIM, SB_PATCH, IMG, 1 + SB_N_STORAGE };
        if (sb_launch(ctx->fn_patch, (unsigned)N_PATCH, 1, 1, 256, 1, 1,
                      0, &p, sizeof(p)) < 0)
            return HIP_SAM3D_BODY_E_LOAD;
    }
    if (sb_bf16_round(ctx, ctx->d_tok, N_TOK * SB_DIM) < 0)
        return HIP_SAM3D_BODY_E_LOAD;
    if (hipDeviceSynchronize() != hipSuccess) return HIP_SAM3D_BODY_E_LOAD;
    t_embed_ms = sb_time_ms() - t_embed0;

    /* Allocate per-block runtime scratch on first use. */
    #define ENSURE(field, bytes) do { \
        if (!ctx->field) { \
            if (hipMalloc(&ctx->field, (bytes)) != hipSuccess) \
                return HIP_SAM3D_BODY_E_LOAD; \
        } \
    } while (0)
    ENSURE(d_ln,   (size_t)N_TOK * SB_DIM * sizeof(float));
    ENSURE(d_qkv,  (size_t)N_TOK * 3 * SB_DIM * sizeof(float));
    ENSURE(d_kt,   (size_t)SB_HEADS * N_TOK * SB_HEAD_DIM * sizeof(float));
    ENSURE(d_vt,   (size_t)SB_HEADS * N_TOK * SB_HEAD_DIM * sizeof(float));
    ENSURE(d_attn, (size_t)N_TOK * SB_DIM * sizeof(float));
    ENSURE(d_proj, (size_t)N_TOK * SB_DIM * sizeof(float));
    ENSURE(d_gate, (size_t)N_TOK * SB_FFN * sizeof(float));
    ENSURE(d_up,   (size_t)N_TOK * SB_FFN * sizeof(float));
    #undef ENSURE

    /* ─── 32 transformer blocks ─── */
    const double t_blocks0 = sb_time_ms();
    const float scale = 1.0f / sqrtf((float)SB_HEAD_DIM);
    const int patch_start = 1 + SB_N_STORAGE;

    for (int L = 0; L < SB_N_BLK; L++) {
        sb_block *b = &ctx->blk[L];

        /* LN1: d_ln <- LN(d_tok, norm1_w, norm1_b) */
        {
            struct __attribute__((packed)) {
                void *dst; const void *src, *w, *bb; int dim; float eps;
            } p = { ctx->d_ln, ctx->d_tok, b->norm1_w, b->norm1_b,
                    SB_DIM, SB_LN_EPS };
            if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                          256 * 4, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_ln, N_TOK * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* QKV: d_qkv <- gemm(qkv_w, d_ln) + qkv_b. Out cols = 3*D. */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_qkv, b->qkv_w, ctx->d_ln, b->qkv_b,
                    3 * SB_DIM, SB_DIM, N_TOK };
            if (sb_gemm_tiled(ctx, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_qkv, N_TOK * 3 * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* RoPE on Q,K (patch tokens only). */
        {
            struct __attribute__((packed)) {
                void *qkv; const void *cos_t, *sin_t;
                int n_patch, patch_start, heads, head_dim, D;
            } p = { ctx->d_qkv, ctx->w_rope_cos, ctx->w_rope_sin,
                    N_PATCH, patch_start, SB_HEADS, SB_HEAD_DIM, SB_DIM };
            if (sb_launch(ctx->fn_rope_qk, (unsigned)N_PATCH, 1, 1,
                          SB_HEADS, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_qkv, N_TOK * 3 * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* kv_transpose: deinterleave K, V into per-head contiguous layout. */
        {
            struct __attribute__((packed)) {
                void *K, *V; const void *qkv;
                int n_tok, dim, heads, hd;
            } p = { ctx->d_kt, ctx->d_vt, ctx->d_qkv,
                    N_TOK, SB_DIM, SB_HEADS, SB_HEAD_DIM };
            unsigned total = (unsigned)(N_TOK * SB_DIM);
            if (sb_launch(ctx->fn_kv_tx, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }

        /* FlashAttention: d_attn <- softmax(Q K^T * scale) V. */
        {
            struct __attribute__((packed)) {
                void *out; const void *qkv, *K, *V;
                int n_tok, dim, heads, hd; float sc;
            } p = { ctx->d_attn, ctx->d_qkv, ctx->d_kt, ctx->d_vt,
                    N_TOK, SB_DIM, SB_HEADS, SB_HEAD_DIM, scale };
            unsigned gy = (unsigned)((N_TOK + 63) / 64);
            unsigned shmem = 2u * 16u * 64u * sizeof(float);
            /* Opt-in BF16-WMMA FA (SAM3D_FA_WMMA): block 128 (4 waves), static
             * LDS (shmem 0). dinov3 head_dim is 64, which the kernel requires. */
            int use_fa_wmma = sb_use_fa_wmma() && ctx->fn_fa_wmma && SB_HEAD_DIM == 64;
            if (use_fa_wmma) {
                if (sb_launch(ctx->fn_fa_wmma, SB_HEADS, gy, 1, 128, 1, 1,
                              0, &p, sizeof(p)) < 0)
                    return HIP_SAM3D_BODY_E_LOAD;
            } else if (sb_launch(ctx->fn_fa, SB_HEADS, gy, 1, 64, 1, 1,
                          shmem, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_attn, N_TOK * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* Output projection: d_proj <- gemm(proj_w, d_attn) + proj_b. */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_proj, b->proj_w, ctx->d_attn, b->proj_b,
                    SB_DIM, SB_DIM, N_TOK };
            if (sb_gemm_tiled(ctx, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_proj, N_TOK * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* LayerScale1 + residual: d_tok += d_proj * ls1. */
        {
            struct __attribute__((packed)) {
                void *hidden; const void *proj, *gamma; int n_tok, dim;
            } p = { ctx->d_tok, ctx->d_proj, b->ls1, N_TOK, SB_DIM };
            unsigned total = (unsigned)(N_TOK * SB_DIM);
            if (sb_launch(ctx->fn_layerscale_add, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_tok, N_TOK * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* LN2: d_ln <- LN(d_tok, norm2_w, norm2_b) */
        {
            struct __attribute__((packed)) {
                void *dst; const void *src, *w, *bb; int dim; float eps;
            } p = { ctx->d_ln, ctx->d_tok, b->norm2_w, b->norm2_b,
                    SB_DIM, SB_LN_EPS };
            if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                          256 * 4, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_ln, N_TOK * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* SwiGLU: d_gate <- gemm(w1, d_ln) + b1; d_up <- gemm(w2, d_ln) + b2. */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } pg = { ctx->d_gate, b->w1_w, ctx->d_ln, b->w1_b,
                     SB_FFN, SB_DIM, N_TOK };
            if (sb_gemm_tiled(ctx, &pg, sizeof(pg)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } pu = { ctx->d_up, b->w2_w, ctx->d_ln, b->w2_b,
                     SB_FFN, SB_DIM, N_TOK };
            if (sb_gemm_tiled(ctx, &pu, sizeof(pu)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_gate, N_TOK * SB_FFN) < 0)
            return HIP_SAM3D_BODY_E_LOAD;
        if (sb_bf16_round(ctx, ctx->d_up, N_TOK * SB_FFN) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* d_gate := silu(d_gate) * d_up. */
        {
            struct __attribute__((packed)) {
                void *gate; const void *up; int n;
            } p = { ctx->d_gate, ctx->d_up, N_TOK * SB_FFN };
            unsigned total = (unsigned)(N_TOK * SB_FFN);
            if (sb_launch(ctx->fn_silu_mul, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_gate, N_TOK * SB_FFN) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* w3: d_proj <- gemm(w3, d_gate) + b3.   (FFN→D)  reuse d_proj */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_proj, b->w3_w, ctx->d_gate, b->w3_b,
                    SB_DIM, SB_FFN, N_TOK };
            if (sb_gemm_tiled(ctx, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_proj, N_TOK * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;

        /* LayerScale2 + residual: d_tok += d_proj * ls2. */
        {
            struct __attribute__((packed)) {
                void *hidden; const void *proj, *gamma; int n_tok, dim;
            } p = { ctx->d_tok, ctx->d_proj, b->ls2, N_TOK, SB_DIM };
            unsigned total = (unsigned)(N_TOK * SB_DIM);
            if (sb_launch(ctx->fn_layerscale_add, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return HIP_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_tok, N_TOK * SB_DIM) < 0)
            return HIP_SAM3D_BODY_E_LOAD;
    }
    if (hipDeviceSynchronize() != hipSuccess) return HIP_SAM3D_BODY_E_LOAD;
    t_blocks_ms = sb_time_ms() - t_blocks0;

