lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    /* Final LayerNorm in-place via d_proj scratch, then copy back to d_tok. */
    const double t_final0 = sb_time_ms();
    {
        struct __attribute__((packed)) {
            void *dst; const void *src, *w, *bb; int dim; float eps;
        } p = { ctx->d_proj, ctx->d_tok, ctx->w_norm_w, ctx->w_norm_b,
                SB_DIM, SB_LN_EPS };
        if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                      256 * 4, &p, sizeof(p)) < 0)
            return HIP_SAM3D_BODY_E_LOAD;
    }
    if (sb_bf16_round(ctx, ctx->d_proj, N_TOK * SB_DIM) < 0)
        return HIP_SAM3D_BODY_E_LOAD;

    if (hipDeviceSynchronize() != hipSuccess) return HIP_SAM3D_BODY_E_LOAD;
    t_final_norm_ms = sb_time_ms() - t_final0;

    /* Copy final encoder tokens (post-LN) to host. */
    const double t_read0 = sb_time_ms();
    free(ctx->encoder_tokens.data);
    ctx->encoder_tokens.data =
        (float *)malloc((size_t)N_TOK * SB_DIM * sizeof(float));
    if (!ctx->encoder_tokens.data) return HIP_SAM3D_BODY_E_LOAD;
    if (hipMemcpy(ctx->encoder_tokens.data, ctx->d_proj,
                  (size_t)N_TOK * SB_DIM * sizeof(float),
                  hipMemcpyDeviceToHost) != hipSuccess)
        return HIP_SAM3D_BODY_E_LOAD;
    ctx->encoder_tokens.n = N_TOK;
    ctx->encoder_tokens.c = SB_DIM;
    t_readback_ms = sb_time_ms() - t_read0;

    if (ctx->verbose >= 1) {
        fprintf(stderr, "sam3d_body: encoder forward done "
                        "(%d blocks, N_TOK=%d, D=%d)\n",
                SB_N_BLK, N_TOK, SB_DIM);
        fprintf(stderr,
                "[sam3d_body][timing] encoder total %.3f ms "
                "(preprocess+upload %.3f, prepend+patch %.3f, "
                "blocks %.3f, final_norm %.3f, readback %.3f)\n",
                sb_time_ms() - t_encoder0, t_preprocess_ms, t_embed_ms,
                t_blocks_ms, t_final_norm_ms, t_readback_ms);
    }

    return HIP_SAM3D_BODY_E_OK;
}

/* Self-driven decoder forward. Mirrors cpu/sam3d_body/sam3d_body_runner.c
 * (self_drive_decoder_inputs + sam3d_body_decoder_forward_full) but the
 * heavy GEMMs (ray_cond_emb, build_tokens, the 6 decoder layers,
 * norm_final + heads, kp_token_update) run on the GPU via the
 * hip_sam3d_body_debug_run_* entry points used by verify_decoder.c.
 *
 * MHR skinning + keypoints_from_mesh + camera_project still run on the
 * CPU (Step 7 — CUDA MHR — is deferred per the original plan). */
int hip_sam3d_body_run_decoder(hip_sam3d_body_ctx *ctx)
{
    if (!ctx) return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->encoder_tokens.data) {
        fprintf(stderr, "[hip_sam3d_body] run_decoder: encoder tokens "
                        "not populated — call run_encoder first\n");
        return HIP_SAM3D_BODY_E_INVAL;
    }
    if (!ctx->cpu_dec) return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->cpu_mhr) {
        fprintf(stderr, "[hip_sam3d_body] run_decoder: MHR assets not "
                        "loaded — set cfg.mhr_assets_dir at create time\n");
        return HIP_SAM3D_BODY_E_INVAL;
    }

    const double t_decoder0 = sb_time_ms();
    double t_geom_ms = 0.0, t_encoder_permute_ms = 0.0, t_rays_ms = 0.0;
    double t_ray_cond_ms = 0.0, t_dense_pe_ms = 0.0, t_ctx_permute_ms = 0.0;
    double t_condition_ms = 0.0, t_build_tokens_ms = 0.0, t_workspace_ms = 0.0;
    double t_layer_ms[SB_DEC_LAYERS] = {0};
    double t_norm_heads_ms[SB_DEC_LAYERS + 1] = {0};
    double t_decode_pose_ms[SB_DEC_LAYERS + 1] = {0};
    double t_mhr_ms[SB_DEC_LAYERS + 1] = {0};
    double t_keypoints_ms[SB_DEC_LAYERS + 1] = {0};
    double t_project_ms[SB_DEC_LAYERS + 1] = {0};
    double t_kp_update_ms[SB_DEC_LAYERS] = {0};
    double t_output_ms = 0.0;

    const sam3d_body_decoder_model *m = ctx->cpu_dec;
    const int Dc  = m->kv_dim;          /* 1280 */
    const int D   = m->dim;             /* 1024 */
    const int K   = m->n_keypoints;     /* 70 */
    const int NL  = m->n_layers;        /* 6 */
    const int N_Q = 1 + 1 + 1 + m->n_hand_tokens + 2 * K;  /* 145 */
    const int V   = 18439;
    const int J   = 127;
    /* Encoder-grid + image-size geometry depends on backbone:
     *   dinov3-h+:  IMG_H=IMG_W=512, gh=gw=32, N_C=1024, n_prefix=5 (CLS + 4 reg)
     *   vit-h:      IMG_H=512, IMG_W=384, gh=32, gw=24, N_C=768, n_prefix=0 */
    const int is_vith = (ctx->cfg.backbone == HIP_SAM3D_BODY_BACKBONE_VITH);
    const int IMG_H = is_vith ? SB_VITH_IMG_H : ctx->cfg.image_size;
    const int IMG_W = is_vith ? SB_VITH_IMG_W : ctx->cfg.image_size;
    const int gh    = is_vith ? SB_VITH_GRID_H : (ctx->cfg.image_size / SB_PATCH);
    const int gw    = is_vith ? SB_VITH_GRID_W : (ctx->cfg.image_size / SB_PATCH);
    const int N_C   = gh * gw;
    const int n_prefix = is_vith ? 0 : (1 + SB_N_STORAGE);

    if (ctx->encoder_tokens.n != n_prefix + N_C ||
        ctx->encoder_tokens.c != Dc) {
        fprintf(stderr, "[hip_sam3d_body] encoder shape mismatch: "
                        "tokens=(%d,%d), expected (%d,%d)\n",
                ctx->encoder_tokens.n, ctx->encoder_tokens.c,
                n_prefix + N_C, Dc);
        return HIP_SAM3D_BODY_E_INVAL;
    }

    /* TopdownAffine + cam_int are cached by run_encoder so the warp
     * matrix used to produce the DINOv3 input matches the rays_xyz /
     * cam_int seen by the decoder. Fall back to recomputing only if the
     * encoder was driven via the debug normalized-input path. */
    float bbox_xyxy[4], center[2], scale[2], warp[6], cam_int[9];
    const double t_geom0 = sb_time_ms();
    if (ctx->self_pp_set) {
        memcpy(center,  ctx->self_center,  sizeof(center));
        memcpy(scale,   ctx->self_scale,   sizeof(scale));
        memcpy(warp,    ctx->self_warp,    sizeof(warp));
        memcpy(cam_int, ctx->self_cam_int, sizeof(cam_int));
    } else {
        if (ctx->has_bbox) {
            memcpy(bbox_xyxy, ctx->bbox, sizeof(bbox_xyxy));
        } else {
            bbox_xyxy[0] = 0; bbox_xyxy[1] = 0;
            bbox_xyxy[2] = (float)ctx->img_w; bbox_xyxy[3] = (float)ctx->img_h;
        }
        /* Both backbones run TopdownAffine to a 512×512 working canvas; the
         * vith W-axis crop happens *after* the affine, so the affine target
         * size stays 512×512 here regardless of variant. */
        sam3d_body_compute_bbox_affine(bbox_xyxy, /*padding=*/1.25f,
                                       /*aspect_ratio_pre=*/0.75f,
                                       SB_VITH_IMG_H, SB_VITH_IMG_H,
                                       center, scale, warp);
        sam3d_body_default_cam_int(ctx->img_w, ctx->img_h, cam_int);
        if (ctx->focal_hint > 0) {
            cam_int[0] = ctx->focal_hint;
            cam_int[4] = ctx->focal_hint;
        }
    }
    (void)bbox_xyxy;
    t_geom_ms = sb_time_ms() - t_geom0;

    /* For vith the decoder consumes the (384, 512) cropped canvas; shift the
     * affine X-translation by -64·a00 so j=0 in the cropped grid maps back to
     * the correct source pixel, equivalent to evaluating the original 512×512
     * affine at x' = x + 64. */
    float warp_for_rays[6];
    memcpy(warp_for_rays, warp, sizeof(warp_for_rays));
    if (is_vith)
        warp_for_rays[2] = warp[2] - 64.0f * warp[0];

    /* ---- Permute encoder tokens (drop CLS+regs) → image_emb_pre (Dc, H, W). ---- */
    const double t_perm0 = sb_time_ms();
    float *img_emb_pre = (float *)malloc((size_t)Dc * N_C * sizeof(float));
    if (!img_emb_pre) return HIP_SAM3D_BODY_E_LOAD;
    {
        const float *patch = ctx->encoder_tokens.data + (size_t)n_prefix * Dc;
        for (int n = 0; n < N_C; n++)
            for (int c = 0; c < Dc; c++)
                img_emb_pre[(size_t)c * N_C + n] = patch[(size_t)n * Dc + c];
    }
    t_encoder_permute_ms = sb_time_ms() - t_perm0;

