lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    /* ---- ray_cond_xyz (host) ---- */
    const double t_rays0 = sb_time_ms();
    float *rays_xyz = (float *)malloc((size_t)N_C * 3 * sizeof(float));
    if (!rays_xyz) { free(img_emb_pre); return HIP_SAM3D_BODY_E_LOAD; }
    if (sam3d_body_compute_ray_cond_xyz(cam_int, warp_for_rays, IMG_H, IMG_W,
                                        gh, gw, rays_xyz) != 0) {
        free(img_emb_pre); free(rays_xyz);
        return HIP_SAM3D_BODY_E_INVAL;
    }
    t_rays_ms = sb_time_ms() - t_rays0;

    /* ---- ray_cond_emb on GPU → img_emb_post (Dc, H, W) ---- */
    const double t_raycond0 = sb_time_ms();
    float *img_emb = (float *)malloc((size_t)Dc * N_C * sizeof(float));
    if (!img_emb) { free(img_emb_pre); free(rays_xyz); return HIP_SAM3D_BODY_E_LOAD; }
    if (hip_sam3d_body_debug_run_ray_cond(ctx, img_emb_pre, rays_xyz,
                                           gh, gw, img_emb) != 0) {
        free(img_emb_pre); free(rays_xyz); free(img_emb);
        return HIP_SAM3D_BODY_E_LOAD;
    }
    t_ray_cond_ms = sb_time_ms() - t_raycond0;
    free(img_emb_pre);
    free(rays_xyz);

    /* ---- dense_pe (CPU; small enough to stay there). ---- */
    const double t_dense0 = sb_time_ms();
    float *image_pe_chw = (float *)malloc((size_t)Dc * N_C * sizeof(float));
    if (!image_pe_chw) { free(img_emb); return HIP_SAM3D_BODY_E_LOAD; }
    if (sam3d_body_get_dense_pe(m, gh, gw, /*n_threads=*/0,
                                image_pe_chw) != 0) {
        free(img_emb); free(image_pe_chw);
        return HIP_SAM3D_BODY_E_INVAL;
    }
    /* ctx_pe in token form (HW, Dc) for the decoder layer's context_pe. */
    float *ctx_pe_tok = (float *)malloc((size_t)N_C * Dc * sizeof(float));
    if (!ctx_pe_tok) { free(img_emb); free(image_pe_chw); return HIP_SAM3D_BODY_E_LOAD; }
    for (int n = 0; n < N_C; n++)
        for (int c = 0; c < Dc; c++)
            ctx_pe_tok[(size_t)n * Dc + c] =
                image_pe_chw[(size_t)c * N_C + n];
    free(image_pe_chw);
    t_dense_pe_ms = sb_time_ms() - t_dense0;

    /* image_emb in token form (HW, Dc) for the decoder layer's context_in. */
    const double t_ctx0 = sb_time_ms();
    float *ctx_in = (float *)malloc((size_t)N_C * Dc * sizeof(float));
    if (!ctx_in) { free(img_emb); free(ctx_pe_tok); return HIP_SAM3D_BODY_E_LOAD; }
    for (int n = 0; n < N_C; n++)
        for (int c = 0; c < Dc; c++)
            ctx_in[(size_t)n * Dc + c] = img_emb[(size_t)c * N_C + n];
    t_ctx_permute_ms = sb_time_ms() - t_ctx0;

    /* ---- condition_info, init_input, prev_input, prompt_in ---- */
    const double t_cond0 = sb_time_ms();
    float ori_img_size[2] = { (float)ctx->img_w, (float)ctx->img_h };
    float img_size[2]     = { (float)IMG_W,      (float)IMG_H        };
    float bbox_scale1[1]  = { scale[0] };
    float condition_info[3];
    sam3d_body_compute_condition_info(center, bbox_scale1, ori_img_size,
                                      cam_int, /*use_intrin_center=*/0,
                                      condition_info);

    const float *ip = (const float *)m->init_pose.data;
    const float *ic = (const float *)m->init_camera.data;
    float init_input[525], prev_input[522], prompt_in[1280];
    memcpy(init_input,         condition_info, 3 * sizeof(float));
    memcpy(init_input + 3,     ip, 519 * sizeof(float));
    memcpy(init_input + 3+519, ic,   3 * sizeof(float));
    memcpy(prev_input,         ip, 519 * sizeof(float));
    memcpy(prev_input + 519,   ic,   3 * sizeof(float));
    if (sam3d_body_invalid_prompt_token(m, prompt_in) != 0) {
        free(img_emb); free(ctx_pe_tok); free(ctx_in);
        return HIP_SAM3D_BODY_E_INVAL;
    }
    t_condition_ms = sb_time_ms() - t_cond0;

    /* ---- build_tokens on GPU → init_x, init_xpe ---- */
    const double t_build0 = sb_time_ms();
    float *init_x   = (float *)malloc((size_t)N_Q * D * sizeof(float));
    float *init_xpe = (float *)malloc((size_t)N_Q * D * sizeof(float));
    if (!init_x || !init_xpe) {
        free(img_emb); free(ctx_pe_tok); free(ctx_in);
        free(init_x); free(init_xpe);
        return HIP_SAM3D_BODY_E_LOAD;
    }
    if (hip_sam3d_body_debug_run_build_tokens(ctx, init_input, prev_input,
                                               prompt_in, init_x, init_xpe) != 0) {
        free(img_emb); free(ctx_pe_tok); free(ctx_in);
        free(init_x); free(init_xpe);
        return HIP_SAM3D_BODY_E_LOAD;
    }
    t_build_tokens_ms = sb_time_ms() - t_build0;

    /* ---- camera_batch ---- */
    sam3d_body_camera_batch B;
    memcpy(B.cam_int,      cam_int, 9 * sizeof(float));
    memcpy(B.bbox_center,  center,  2 * sizeof(float));
    B.bbox_scale = scale[0];
    memcpy(B.ori_img_size, ori_img_size, 2 * sizeof(float));
    memcpy(B.img_size,     img_size,     2 * sizeof(float));
    memcpy(B.affine_trans, warp_for_rays, 6 * sizeof(float));
    B.use_intrin_center    = 0;
    B.default_scale_factor = 1.0f;

    /* ---- Per-layer working buffers + MHR scratch ---- */
    const double t_workspace0 = sb_time_ms();
    float *tokens   = (float *)malloc((size_t)N_Q * D * sizeof(float));
    float *tokens_b = (float *)malloc((size_t)N_Q * D * sizeof(float));
    float *augment  = (float *)malloc((size_t)N_Q * D * sizeof(float));
    float *tokens_n = (float *)malloc((size_t)N_Q * D * sizeof(float));
    const size_t mhr_scratch_floats = (size_t)1 *
        (889 + (size_t)J*8*2 + (size_t)V*3*3);
    float *mhr_scratch = (float *)malloc(mhr_scratch_floats * sizeof(float));
    float *verts_cm = (float *)malloc((size_t)V * 3 * sizeof(float));
    float *gskel_cm = (float *)malloc((size_t)J * 8 * sizeof(float));
    float *verts_m  = (float *)malloc((size_t)V * 3 * sizeof(float));
    float *jc_m     = (float *)malloc((size_t)J * 3 * sizeof(float));
    if (!tokens || !tokens_b || !augment || !tokens_n ||
        !mhr_scratch || !verts_cm || !gskel_cm || !verts_m || !jc_m) {
        free(img_emb); free(ctx_pe_tok); free(ctx_in);
        free(init_x); free(init_xpe);
        free(tokens); free(tokens_b); free(augment); free(tokens_n);
        free(mhr_scratch); free(verts_cm); free(gskel_cm); free(verts_m); free(jc_m);
        return HIP_SAM3D_BODY_E_LOAD;
    }
    memcpy(tokens,  init_x,   (size_t)N_Q * D * sizeof(float));
    memcpy(augment, init_xpe, (size_t)N_Q * D * sizeof(float));
    free(init_x); free(init_xpe);
    t_workspace_ms = sb_time_ms() - t_workspace0;

    /* ---- Per-layer loop. ---- */
    float pose_raw[519], cam_raw[3], pose519[519], cam3[3];
    float mp_buf[204], shape_buf[45], face_buf[72];
    float kp3d_post[70 * 3];
    float kp2d_full[70 * 2], kp2d_crop[70 * 2], kp2d_dep[70];
    float pred_cam_t_world[3];

    int rc_total = 0, rc;
    for (int li = 0; li < NL; li++) {
        double t0 = sb_time_ms();
        rc = hip_sam3d_body_debug_run_decoder_layer(
                ctx, li, tokens, ctx_in, augment, ctx_pe_tok,
                N_Q, N_C, tokens_b);
        if (rc != 0) { rc_total = rc; goto cleanup; }
        t_layer_ms[li] += sb_time_ms() - t0;
        { float *t = tokens; tokens = tokens_b; tokens_b = t; }

        if (li >= NL - 1) break;

        t0 = sb_time_ms();
        /* tokens_norm output is unused downstream — only pose_raw/cam_raw (from
         * row 0) feed the heads. Pass NULL so the LN runs on 1 row, not N_Q. */
        rc = hip_sam3d_body_debug_run_norm_and_heads(
                ctx, tokens, N_Q, NULL, pose_raw, cam_raw);
        if (rc != 0) { rc_total = rc; goto cleanup; }
        t_norm_heads_ms[li] += sb_time_ms() - t0;
        for (int i = 0; i < 519; i++) pose519[i] = pose_raw[i] + ip[i];
        for (int i = 0; i < 3;   i++) cam3[i]    = cam_raw[i]  + ic[i];

        t0 = sb_time_ms();
        if (sam3d_body_decode_pose_raw(m, pose519, /*enable_hand_model=*/0,
                                       mp_buf, shape_buf, face_buf) != 0) {
            rc_total = -1; goto cleanup;
        }
        t_decode_pose_ms[li] += sb_time_ms() - t0;
        t0 = sb_time_ms();
        if (sam3d_body_mhr_forward((const sam3d_body_mhr_assets *)ctx->cpu_mhr,
                                   mp_buf, shape_buf, face_buf,
                                   1, 1, /*n_threads=*/SAM3DB_MHR_THREADS(), mhr_scratch,
                                   verts_cm, gskel_cm) != 0) {
            rc_total = -1; goto cleanup;
        }
        t_mhr_ms[li] += sb_time_ms() - t0;
        for (int i = 0; i < V * 3; i++) verts_m[i] = verts_cm[i] * 0.01f;
        for (int j = 0; j < J; j++) {
            jc_m[j*3 + 0] = gskel_cm[(size_t)j*8 + 0] * 0.01f;
            jc_m[j*3 + 1] = gskel_cm[(size_t)j*8 + 1] * 0.01f;
            jc_m[j*3 + 2] = gskel_cm[(size_t)j*8 + 2] * 0.01f;
        }
        t0 = sb_time_ms();
        if (sam3d_body_keypoints_from_mesh(m, verts_m, jc_m,
                                           /*enable_hand_model=*/0,
                                           /*n_threads=*/0, kp3d_post) != 0) {
            rc_total = -1; goto cleanup;
        }
        t_keypoints_ms[li] += sb_time_ms() - t0;
        t0 = sb_time_ms();
        if (sam3d_body_camera_project(kp3d_post, cam3, &B, K,
                                      kp2d_full, kp2d_crop, kp2d_dep,
                                      pred_cam_t_world) != 0) {
            rc_total = -1; goto cleanup;
        }
        t_project_ms[li] += sb_time_ms() - t0;

        t0 = sb_time_ms();
        rc = hip_sam3d_body_debug_run_kp_token_update(
                ctx, li, img_emb, gh, gw,
                kp2d_crop, kp2d_dep, kp3d_post,
                N_Q, tokens, augment);
        if (rc != 0) { rc_total = rc; goto cleanup; }
        t_kp_update_ms[li] += sb_time_ms() - t0;
    }

