lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    /* ---- Final norm + heads + MHR (post-loop). ---- */
    {
    const int ti = NL;
    double t0 = sb_time_ms();
    /* tokens_norm output unused downstream (see per-layer note) — pass NULL. */
    rc = hip_sam3d_body_debug_run_norm_and_heads(
            ctx, tokens, N_Q, NULL, pose_raw, cam_raw);
    if (rc != 0) { rc_total = rc; goto cleanup; }
    t_norm_heads_ms[ti] += sb_time_ms() - t0;
    for (int i = 0; i < 519; i++) pose519[i] = pose_raw[i] + ip[i];
    for (int i = 0; i < 3;   i++) cam3[i]    = cam_raw[i]  + ic[i];

    t0 = sb_time_ms();
    if (sam3d_body_decode_pose_raw(m, pose519, /*enable_hand_model=*/0,
                                   mp_buf, shape_buf, face_buf) != 0) {
        rc_total = -1; goto cleanup;
    }
    t_decode_pose_ms[ti] += sb_time_ms() - t0;
    t0 = sb_time_ms();
    if (sam3d_body_mhr_forward((const sam3d_body_mhr_assets *)ctx->cpu_mhr,
                               mp_buf, shape_buf, face_buf,
                               1, 1, /*n_threads=*/SAM3DB_MHR_THREADS(), mhr_scratch,
                               verts_cm, gskel_cm) != 0) {
        rc_total = -1; goto cleanup;
    }
    t_mhr_ms[ti] += sb_time_ms() - t0;
    for (int i = 0; i < V * 3; i++) verts_m[i] = verts_cm[i] * 0.01f;
    for (int j = 0; j < J; j++) {
        jc_m[j*3 + 0] = gskel_cm[(size_t)j*8 + 0] * 0.01f;
        jc_m[j*3 + 1] = gskel_cm[(size_t)j*8 + 1] * 0.01f;
        jc_m[j*3 + 2] = gskel_cm[(size_t)j*8 + 2] * 0.01f;
    }
    t0 = sb_time_ms();
    if (sam3d_body_keypoints_from_mesh(m, verts_m, jc_m,
                                       /*enable_hand_model=*/0,
                                       /*n_threads=*/0, kp3d_post) != 0) {
        rc_total = -1; goto cleanup;
    }
    t_keypoints_ms[ti] += sb_time_ms() - t0;
    t0 = sb_time_ms();
    if (sam3d_body_camera_project(kp3d_post, cam3, &B, K,
                                  kp2d_full, kp2d_crop, kp2d_dep,
                                  pred_cam_t_world) != 0) {
        rc_total = -1; goto cleanup;
    }
    t_project_ms[ti] += sb_time_ms() - t0;
    }

    /* ---- Populate ctx outputs (vertices in meters, kp arrays, mhr_params,
     *      cam_t world, focal). ---- */
    {
    const double t_output0 = sb_time_ms();
    free(ctx->vertices);
    ctx->vertices = (float *)malloc((size_t)V * 3 * sizeof(float));
    if (!ctx->vertices) { rc_total = -1; goto cleanup; }
    /* Post-flip cam frame: matches sam3d_body_decoder_forward_full. */
    for (int i = 0; i < V; i++) {
        ctx->vertices[i*3 + 0] =  verts_m[i*3 + 0];
        ctx->vertices[i*3 + 1] = -verts_m[i*3 + 1];
        ctx->vertices[i*3 + 2] = -verts_m[i*3 + 2];
    }
    ctx->n_vertices = V;

    free(ctx->keypoints_3d);
    ctx->keypoints_3d = (float *)malloc((size_t)K * 3 * sizeof(float));
    if (!ctx->keypoints_3d) { rc_total = -1; goto cleanup; }
    memcpy(ctx->keypoints_3d, kp3d_post, (size_t)K * 3 * sizeof(float));
    ctx->n_kp_3d = K;

    free(ctx->keypoints_2d);
    ctx->keypoints_2d = (float *)malloc((size_t)K * 2 * sizeof(float));
    if (!ctx->keypoints_2d) { rc_total = -1; goto cleanup; }
    memcpy(ctx->keypoints_2d, kp2d_crop, (size_t)K * 2 * sizeof(float));
    ctx->n_kp_2d = K;

    free(ctx->mhr_params);
    ctx->mhr_params = (float *)malloc(519 * sizeof(float));
    if (!ctx->mhr_params) { rc_total = -1; goto cleanup; }
    memcpy(ctx->mhr_params, pose519, 519 * sizeof(float));
    ctx->mhr_params_n = 519;

    memcpy(ctx->cam_t, pred_cam_t_world, sizeof(ctx->cam_t));
    ctx->focal_px = cam_int[0];

    /* Faces from the MHR-head asset (kept on host as i64 → i32). */
    if (m->faces.data && !ctx->faces) {
        int F = (int)m->faces.dims[0];
        ctx->faces = (int32_t *)malloc((size_t)F * 3 * sizeof(int32_t));
        if (!ctx->faces) { rc_total = -1; goto cleanup; }
        const int64_t *src = (const int64_t *)m->faces.data;
        for (int i = 0; i < F * 3; i++)
            ctx->faces[i] = (int32_t)src[i];
        ctx->n_faces = F;
    }
    t_output_ms = sb_time_ms() - t_output0;
    }

cleanup:
    if (ctx->verbose >= 1) {
        double sum_layer = 0.0, sum_norm = 0.0, sum_decode = 0.0;
        double sum_mhr = 0.0, sum_kp = 0.0, sum_proj = 0.0, sum_kpu = 0.0;
        for (int i = 0; i < NL; i++) {
            sum_layer += t_layer_ms[i];
            sum_kpu += t_kp_update_ms[i];
        }
        for (int i = 0; i <= NL; i++) {
            sum_norm += t_norm_heads_ms[i];
            sum_decode += t_decode_pose_ms[i];
            sum_mhr += t_mhr_ms[i];
            sum_kp += t_keypoints_ms[i];
            sum_proj += t_project_ms[i];
        }
        fprintf(stderr,
                "[sam3d_body][timing] decoder total %.3f ms "
                "(geom %.3f, encoder_permute %.3f, rays %.3f, "
                "ray_cond %.3f, dense_pe %.3f, ctx_permute %.3f, "
                "condition %.3f, build_tokens %.3f, workspace %.3f, "
                "layers %.3f, norm_heads %.3f, decode_pose %.3f, "
                "mhr %.3f, keypoints %.3f, camera_project %.3f, "
                "kp_update %.3f, output %.3f)\n",
                sb_time_ms() - t_decoder0,
                t_geom_ms, t_encoder_permute_ms, t_rays_ms,
                t_ray_cond_ms, t_dense_pe_ms, t_ctx_permute_ms,
                t_condition_ms, t_build_tokens_ms, t_workspace_ms,
                sum_layer, sum_norm, sum_decode, sum_mhr, sum_kp,
                sum_proj, sum_kpu, t_output_ms);
        for (int i = 0; i < NL; i++) {
            fprintf(stderr,
                    "[sam3d_body][timing] decoder layer %d: layer %.3f ms",
                    i, t_layer_ms[i]);
            if (i < NL - 1) {
                fprintf(stderr,
                        ", norm_heads %.3f, decode_pose %.3f, mhr %.3f, "
                        "keypoints %.3f, camera_project %.3f, kp_update %.3f",
                        t_norm_heads_ms[i], t_decode_pose_ms[i],
                        t_mhr_ms[i], t_keypoints_ms[i], t_project_ms[i],
                        t_kp_update_ms[i]);
            }
            fprintf(stderr, "\n");
        }
        fprintf(stderr,
                "[sam3d_body][timing] decoder final: norm_heads %.3f ms, "
                "decode_pose %.3f, mhr %.3f, keypoints %.3f, "
                "camera_project %.3f\n",
                t_norm_heads_ms[NL], t_decode_pose_ms[NL], t_mhr_ms[NL],
                t_keypoints_ms[NL], t_project_ms[NL]);
    }
    free(img_emb); free(ctx_pe_tok); free(ctx_in);
    free(tokens); free(tokens_b); free(augment); free(tokens_n);
    free(mhr_scratch); free(verts_cm); free(gskel_cm); free(verts_m); free(jc_m);
    return (rc_total == 0) ? HIP_SAM3D_BODY_E_OK
                           : HIP_SAM3D_BODY_E_LOAD;
}

/* Step 9: MHR skinning is folded into run_decoder (the per-layer
 * MHR-in-the-loop runs CPU mhr_forward; CUDA MHR skinning is Step 7
 * which stays deferred per the original plan). Keep the entry point
 * as a shim for API symmetry. */
int hip_sam3d_body_run_mhr(hip_sam3d_body_ctx *ctx)
{
    if (!ctx) return HIP_SAM3D_BODY_E_INVAL;
    return ctx->vertices ? HIP_SAM3D_BODY_E_OK
                         : HIP_SAM3D_BODY_E_NOT_IMPLEMENTED;
}

