lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
int hip_sam3d_body_debug_run_ray_cond(hip_sam3d_body_ctx *ctx,
                                       const float *image_emb_chw,
                                       const float *rays_hwc,
                                       int H, int W,
                                       float *out_chw)
{
    if (!ctx || !image_emb_chw || !rays_hwc || !out_chw || H <= 0 || W <= 0)
        return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->dec.loaded) {
        fprintf(stderr, "sam3d_body: decoder not loaded\n");
        return HIP_SAM3D_BODY_E_LOAD;
    }
    const int C_img    = SB_DEC_KV_DIM;          /* 1280 */
    const int num_bands = 16;
    const int C_fp     = 3 + 6 * num_bands;       /* 99 */
    const int C_pre    = C_img + C_fp;            /* 1379 */
    const int N        = H * W;

    void *d_pre = NULL, *d_post = NULL, *d_rays = NULL, *d_out = NULL;
    size_t pre_bytes  = (size_t)C_pre * N * sizeof(float);
    size_t post_bytes = (size_t)C_img * N * sizeof(float);
    size_t rays_bytes = (size_t)N * 3 * sizeof(float);
    if (hipMalloc(&d_pre,  pre_bytes)  != hipSuccess) goto fail;
    if (hipMalloc(&d_post, post_bytes) != hipSuccess) goto fail;
    if (hipMalloc(&d_rays, rays_bytes) != hipSuccess) goto fail;
    if (hipMalloc(&d_out,  post_bytes) != hipSuccess) goto fail;

    /* Upload image_emb into rows [0..C_img) of preconv. */
    if (hipMemcpy(d_pre, image_emb_chw,
                  (size_t)C_img * N * sizeof(float),
                  hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_rays, rays_hwc, rays_bytes,
                  hipMemcpyHostToDevice) != hipSuccess) goto fail;

    /* Fill rows [C_img..C_img+99) with fourier features. */
    {
        float *fp_chw = (float *)d_pre + (size_t)C_img * N;
        struct __attribute__((packed)) {
            void *fp_chw; void *rays; int N; int nb;
        } a = { fp_chw, d_rays, N, num_bands };
        unsigned bx = 256;
        unsigned gx = (unsigned)((N + bx - 1) / bx);
        if (sb_launch(ctx->fn_ray_cond_fourier, gx, 1, 1, bx, 1, 1, 0,
                      &a, sizeof(a)) < 0) goto fail;
    }

    /* postconv = ray_cond_conv_w (C_img, C_pre) @ preconv (C_pre, N) */
    {
        struct __attribute__((packed)) {
            void *out; void *W; void *src; int Co; int Ci; int N;
        } a = { d_post, ctx->dec.ray_cond_conv_w, d_pre,
                C_img, C_pre, N };
        unsigned bx = 256;
        unsigned gx = (unsigned)((N + bx - 1) / bx);
        unsigned gy = (unsigned)C_img;
        if (sb_launch(ctx->fn_conv1x1_chw, gx, gy, 1, bx, 1, 1, 0,
                      &a, sizeof(a)) < 0) goto fail;
    }

    /* out = LayerNorm2d(postconv) using ray_cond_norm.{weight,bias}. */
    {
        struct __attribute__((packed)) {
            void *dst; void *src; void *g; void *b;
            int C; int N; float eps;
        } a = { d_out, d_post,
                ctx->dec.ray_cond_norm_w, ctx->dec.ray_cond_norm_b,
                C_img, N, SB_DEC_LN_EPS };
        unsigned bx = 256;
        unsigned gx = (unsigned)((N + bx - 1) / bx);
        if (sb_launch(ctx->fn_ln_chw, gx, 1, 1, bx, 1, 1, 0,
                      &a, sizeof(a)) < 0) goto fail;
    }

    if (hipMemcpy(out_chw, d_out, post_bytes,
                  hipMemcpyDeviceToHost) != hipSuccess) goto fail;

    hipFree(d_pre); hipFree(d_post); hipFree(d_rays); hipFree(d_out);
    return HIP_SAM3D_BODY_E_OK;

fail:
    if (d_pre)  hipFree(d_pre);
    if (d_post) hipFree(d_post);
    if (d_rays) hipFree(d_rays);
    if (d_out)  hipFree(d_out);
    return HIP_SAM3D_BODY_E_LOAD;
}

int hip_sam3d_body_debug_run_build_tokens(hip_sam3d_body_ctx *ctx,
                                           const float *init_in,
                                           const float *prev_in,
                                           const float *prompt_in,
                                           float *x_out,
                                           float *x_pe_out)
{
    if (!ctx || !init_in || !prev_in || !prompt_in || !x_out || !x_pe_out)
        return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->dec.loaded) {
        fprintf(stderr, "sam3d_body: decoder not loaded\n");
        return HIP_SAM3D_BODY_E_LOAD;
    }
    const int D       = SB_DEC_DIM;                          /* 1024 */
    const int NKP     = SB_DEC_KP;                           /* 70   */
    const int NHB     = SB_DEC_HAND_TOK;                     /* 2    */
    const int D_init  = SB_DEC_NPOSE + SB_DEC_NCAM + SB_DEC_COND;  /* 525 */
    const int D_prev  = SB_DEC_NPOSE + SB_DEC_NCAM;                /* 522 */
    const int D_prompt = SB_DEC_KV_DIM;                            /* 1280 */
    const int N_TOK   = 1 + 1 + 1 + NHB + NKP + NKP;         /* 145  */
    const size_t row_b = (size_t)D * sizeof(float);
    const size_t tok_b = (size_t)N_TOK * D * sizeof(float);

    void *d_init = NULL, *d_prev = NULL, *d_prompt = NULL;
    void *d_x = NULL, *d_xpe = NULL;
    if (hipMalloc(&d_init,   D_init  * sizeof(float)) != hipSuccess) goto fail;
    if (hipMalloc(&d_prev,   D_prev  * sizeof(float)) != hipSuccess) goto fail;
    if (hipMalloc(&d_prompt, D_prompt * sizeof(float)) != hipSuccess) goto fail;
    if (hipMalloc(&d_x,   tok_b) != hipSuccess) goto fail;
    if (hipMalloc(&d_xpe, tok_b) != hipSuccess) goto fail;

    if (hipMemcpy(d_init,   init_in,   D_init  * sizeof(float),
                  hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_prev,   prev_in,   D_prev  * sizeof(float),
                  hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_prompt, prompt_in, D_prompt * sizeof(float),
                  hipMemcpyHostToDevice) != hipSuccess) goto fail;

    /* Helper macro: launch linear_f32_bias for a single output row. */
    #define LINEAR(p_out, p_w, p_bias, p_x, p_do, p_di) do { \
        struct __attribute__((packed)) { \
            void *o; void *w; void *xx; void *bb; int do_; int di_; \
        } a = { (p_out), (p_w), (p_x), (p_bias), (p_do), (p_di) }; \
        unsigned bx = 256; \
        unsigned gx = (unsigned)(((p_do) + bx - 1) / bx); \
        if (sb_launch(ctx->fn_linear_bias, gx, 1, 1, bx, 1, 1, 0, \
                      &a, sizeof(a)) < 0) goto fail; \
    } while (0)

