lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    if (hipMalloc(&d_x,    bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_ctx,  bx_c) != hipSuccess) goto fail;
    if (hipMalloc(&d_xpe,  bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_cpe,  bx_c) != hipSuccess) goto fail;
    if (hipMalloc(&d_xpe_n, bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_cpe_n, bx_c) != hipSuccess) goto fail;
    if (hipMalloc(&d_x_ln, bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_qk,   bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_Q,    b_qE) != hipSuccess) goto fail;
    if (hipMalloc(&d_K,    (size_t)((N_q > N_c ? N_q : N_c)) * E * sizeof(float)) != hipSuccess) goto fail;
    if (hipMalloc(&d_V,    (size_t)((N_q > N_c ? N_q : N_c)) * E * sizeof(float)) != hipSuccess) goto fail;
    if (hipMalloc(&d_attn, b_qE) != hipSuccess) goto fail;
    if (hipMalloc(&d_proj, bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_x1,   bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_q_in, bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_k_in, bx_c) != hipSuccess) goto fail;
    if (hipMalloc(&d_ctx_ln, bx_c) != hipSuccess) goto fail;
    if (hipMalloc(&d_x2,    bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_x_ln3, bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_ffn_h, b_qF) != hipSuccess) goto fail;
    if (hipMalloc(&d_ffn_o, bx_q) != hipSuccess) goto fail;

    if (hipMemcpy(d_x,   x_in,   bx_q, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_ctx, context_in, bx_c, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_xpe, x_pe_in, bx_q, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_cpe, context_pe_in, bx_c, hipMemcpyHostToDevice) != hipSuccess) goto fail;

    /* Pre-normalize PEs. */
    if (sb_dec_ln(ctx, d_xpe_n, d_xpe, L->ln_pe_1_w, L->ln_pe_1_b, N_q, D,  eps) < 0) goto fail;
    if (sb_dec_ln(ctx, d_cpe_n, d_cpe, L->ln_pe_2_w, L->ln_pe_2_b, N_c, Dc, eps) < 0) goto fail;

    /* ===== Self-attention ===== */
    if (sb_dec_ln(ctx, d_x_ln, d_x, L->ln1_w, L->ln1_b, N_q, D, eps) < 0) goto fail;

    if (skip_first_pe) {
        if (hipMemcpy(d_qk, d_x_ln, bx_q, hipMemcpyDeviceToDevice) != hipSuccess) goto fail;
    } else {
        if (sb_dec_add_two(ctx, d_qk, d_x_ln, d_xpe_n, (int)(N_q * D)) < 0) goto fail;
    }
    /* Q = qk @ Wq^T + bq, K = qk @ Wk^T + bk, V = x_ln @ Wv^T + bv */
    if (sb_dec_gemm(ctx, d_Q, d_qk, L->sa_q_w, L->sa_q_b, N_q, D, E) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_K, d_qk, L->sa_k_w, L->sa_k_b, N_q, D, E) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_V, d_x_ln, L->sa_v_w, L->sa_v_b, N_q, D, E) < 0) goto fail;
    if (sb_dec_sdpa(ctx, d_attn, d_Q, d_K, d_V, N_q, N_q, H, Dh) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_proj, d_attn, L->sa_proj_w, L->sa_proj_b, N_q, E, D) < 0) goto fail;

    /* x1 = x + sa_proj */
    if (sb_dec_add_two(ctx, d_x1, d_x, d_proj, (int)(N_q * D)) < 0) goto fail;

    /* ===== Cross-attention =====
     * q = ln2_1(x1) + x_pe_n
     * ctx_ln = ln2_2(context)
     * k = ctx_ln + cpe_n; v = ctx_ln
     */
    if (sb_dec_ln(ctx, d_q_in, d_x1, L->ln2_1_w, L->ln2_1_b, N_q, D, eps) < 0) goto fail;
    if (sb_dec_add_inplace(ctx, d_q_in, d_xpe_n, (int)(N_q * D)) < 0) goto fail;
    if (sb_dec_ln(ctx, d_ctx_ln, d_ctx, L->ln2_2_w, L->ln2_2_b, N_c, Dc, eps) < 0) goto fail;
    if (sb_dec_add_two(ctx, d_k_in, d_ctx_ln, d_cpe_n, (int)(N_c * Dc)) < 0) goto fail;

    if (sb_dec_gemm(ctx, d_Q, d_q_in,   L->ca_q_w, L->ca_q_b, N_q, D,  E) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_K, d_k_in,   L->ca_k_w, L->ca_k_b, N_c, Dc, E) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_V, d_ctx_ln, L->ca_v_w, L->ca_v_b, N_c, Dc, E) < 0) goto fail;
    if (sb_dec_sdpa(ctx, d_attn, d_Q, d_K, d_V, N_q, N_c, H, Dh) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_proj, d_attn, L->ca_proj_w, L->ca_proj_b, N_q, E, D) < 0) goto fail;

    /* x2 = x1 + ca_proj */
    if (sb_dec_add_two(ctx, d_x2, d_x1, d_proj, (int)(N_q * D)) < 0) goto fail;

    /* ===== FFN =====
     * h = GELU(ffn0(ln3(x2))); out = ffn1(h); x_out = x2 + out
     */
    if (sb_dec_ln(ctx, d_x_ln3, d_x2, L->ln3_w, L->ln3_b, N_q, D, eps) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_ffn_h, d_x_ln3, L->ffn0_w, L->ffn0_b, N_q, D, F) < 0) goto fail;
    if (sb_dec_gelu(ctx, d_ffn_h, (int)(N_q * F)) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_ffn_o, d_ffn_h, L->ffn1_w, L->ffn1_b, N_q, F, D) < 0) goto fail;
    if (sb_dec_add_two(ctx, d_x1, d_x2, d_ffn_o, (int)(N_q * D)) < 0) goto fail;
        /* reuse d_x1 as final out scratch */

    if (hipMemcpy(x_out, d_x1, bx_q, hipMemcpyDeviceToHost) != hipSuccess) goto fail;

    hipFree(d_x); hipFree(d_ctx); hipFree(d_xpe); hipFree(d_cpe);
    hipFree(d_xpe_n); hipFree(d_cpe_n);
    hipFree(d_x_ln); hipFree(d_qk);
    hipFree(d_Q); hipFree(d_K); hipFree(d_V);
    hipFree(d_attn); hipFree(d_proj);
    hipFree(d_x1); hipFree(d_q_in); hipFree(d_k_in); hipFree(d_ctx_ln);
    hipFree(d_x2); hipFree(d_x_ln3); hipFree(d_ffn_h); hipFree(d_ffn_o);
    return HIP_SAM3D_BODY_E_OK;

fail:
    if (d_x)    hipFree(d_x);
    if (d_ctx)  hipFree(d_ctx);
    if (d_xpe)  hipFree(d_xpe);
    if (d_cpe)  hipFree(d_cpe);
    if (d_xpe_n) hipFree(d_xpe_n);
    if (d_cpe_n) hipFree(d_cpe_n);
    if (d_x_ln) hipFree(d_x_ln);
    if (d_qk)   hipFree(d_qk);
    if (d_Q)    hipFree(d_Q);
    if (d_K)    hipFree(d_K);
    if (d_V)    hipFree(d_V);
    if (d_attn) hipFree(d_attn);
    if (d_proj) hipFree(d_proj);
    if (d_x1)   hipFree(d_x1);
    if (d_q_in) hipFree(d_q_in);
    if (d_k_in) hipFree(d_k_in);
    if (d_ctx_ln) hipFree(d_ctx_ln);
    if (d_x2)   hipFree(d_x2);
    if (d_x_ln3) hipFree(d_x_ln3);
    if (d_ffn_h) hipFree(d_ffn_h);
    if (d_ffn_o) hipFree(d_ffn_o);
    return HIP_SAM3D_BODY_E_LOAD;
}

/* ===== kp_token_update (Step 5e) ============================================
 *
 * Mirrors sam3d_body_kp_token_update in common/sam3d_body_decoder.h:
 *   - 2D path: invalid_mask (xy out of [0,1] OR depth<1e-5) → kp_posemb
 *     Linear(2→1024) → ReLU → Linear(1024→1024), zero on invalid →
 *     overwrite augment[5..75). grid_sample(image_emb, kp2d*2, zeros pad)
 *     → kp_feat Linear(1280→1024) → ADD into tokens[5..75).
 *   - 3D path: pelvis-norm subtract avg(joints[9],joints[10]) → kp3d_posemb
 *     Linear(3→1024) → ReLU → Linear(1024→1024) → overwrite augment[75..145).
 * Layer n_layers-1 is short-circuited (matches upstream guard).
 */
static int sb_dec_relu(hip_sam3d_body_ctx *c, void *x, int n)
{
    struct __attribute__((packed)) { void *x; int n; } p = { x, n };
    unsigned bx = 256;
    unsigned gx = (unsigned)((n + bx - 1) / bx);
    return sb_launch(c->fn_relu_inplace, gx, 1, 1, bx, 1, 1, 0, &p, sizeof(p));
}

static int sb_dec_grid_sample(hip_sam3d_body_ctx *c, void *out, const void *src,
                              const void *gxy, const void *invalid,
                              int K, int C, int H, int W)
{
    struct __attribute__((packed)) {
        void *out; const void *src; const void *gxy; const void *invalid;
        int K; int C; int H; int W;
    } p = { out, src, gxy, invalid, K, C, H, W };
    unsigned bx = 256;
    unsigned gx = (unsigned)K;
    unsigned gy = (unsigned)((C + bx - 1) / bx);
    return sb_launch(c->fn_grid_sample, gx, gy, 1, bx, 1, 1, 0, &p, sizeof(p));
}

static int sb_dec_pelvis_norm(hip_sam3d_body_ctx *c, void *out,
                              const void *kp3d, int K)
{
    struct __attribute__((packed)) {
        void *out; const void *kp3d; int K;
    } p = { out, kp3d, K };
    unsigned bx = 64;
    unsigned gx = (unsigned)((K * 3 + bx - 1) / bx);
    return sb_launch(c->fn_kp_pelvis_norm, gx, 1, 1, bx, 1, 1, 0, &p, sizeof(p));
}

static int sb_dec_aug_overwrite(hip_sam3d_body_ctx *c, void *augment,
                                int start_row, const void *posemb,
                                const void *invalid, int K, int D)
{
    /* Pointer args first, scalar args last — matches the kernel signature
     * and avoids the natural-alignment padding hole that __attribute__((packed))
     * would otherwise miscompute when ints are interleaved with pointers. */
    struct __attribute__((packed)) {
        void *augment; const void *posemb; const void *invalid;
        int start_row; int K; int D;
    } p = { augment, posemb, invalid, start_row, K, D };
    unsigned bx = 256;
    unsigned gx = (unsigned)K;
    unsigned gy = (unsigned)((D + bx - 1) / bx);
    return sb_launch(c->fn_augment_overwrite_mask, gx, gy, 1, bx, 1, 1,
                     0, &p, sizeof(p));
}

int hip_sam3d_body_debug_run_kp_token_update(hip_sam3d_body_ctx *ctx,
                                              int layer_idx,
                                              const float *image_emb_chw,
                                              int H, int W,
                                              const float *kp2d_cropped,
                                              const float *kp2d_depth,
                                              const float *kp3d_camera,
                                              int N_q,
                                              float *tokens,
                                              float *token_augment)
{
    if (!ctx || !image_emb_chw || !kp2d_cropped || !kp2d_depth || !kp3d_camera ||
        !tokens || !token_augment)
        return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->dec.loaded || layer_idx < 0 || layer_idx >= SB_DEC_LAYERS)
        return HIP_SAM3D_BODY_E_INVAL;

