lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    if (hipMalloc(&d_coeffs, b_coeffs) != hipSuccess) goto fail;
    if (hipMalloc(&d_vec,    b_vec)    != hipSuccess) goto fail;
    if (base_host && hipMalloc(&d_base, b_base) != hipSuccess) goto fail;
    if (hipMalloc(&d_out,    b_out)    != hipSuccess) goto fail;

    if (hipMemcpy(d_coeffs, coeffs, b_coeffs,
                  hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_vec, vectors_host, b_vec,
                  hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (base_host &&
        hipMemcpy(d_base, base_host, b_base,
                  hipMemcpyHostToDevice) != hipSuccess) goto fail;

    struct __attribute__((packed)) {
        void *out; const void *coeffs; const void *vec; const void *base;
        int N_basis; int V_d;
    } p = { d_out, d_coeffs, d_vec, base_host ? d_base : NULL, N_basis, V_d };
    unsigned bx = 256;
    unsigned gx = (unsigned)((V_d + bx - 1) / bx);
    if (sb_launch(ctx->fn_mhr_blend, gx, 1, 1, bx, 1, 1, 0, &p, sizeof(p)) < 0)
        goto fail;

    if (hipMemcpy(out_host, d_out, b_out,
                  hipMemcpyDeviceToHost) != hipSuccess) goto fail;

    hipFree(d_coeffs); hipFree(d_vec);
    if (d_base) hipFree(d_base);
    hipFree(d_out);
    return 0;

fail:
    if (d_coeffs) hipFree(d_coeffs);
    if (d_vec)    hipFree(d_vec);
    if (d_base)   hipFree(d_base);
    if (d_out)    hipFree(d_out);
    return HIP_SAM3D_BODY_E_LOAD;
}

int hip_sam3d_body_debug_run_blend_shape(hip_sam3d_body_ctx *ctx,
                                          const float *shape_coeffs,
                                          float *out_verts)
{
    if (!ctx || !shape_coeffs || !out_verts) return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->cpu_mhr) {
        fprintf(stderr, "sam3d_body: MHR assets not loaded — "
                        "set cfg.mhr_assets_dir at create time\n");
        return HIP_SAM3D_BODY_E_INVAL;
    }
    const sam3d_body_mhr_assets *a = ctx->cpu_mhr;
    const float *SV = (const float *)a->blend_shape_vectors.data;
    const float *BS = (const float *)a->blend_base_shape.data;
    return hip_sam3d_body_run_blend_combine(ctx, shape_coeffs, SV, BS,
                                             S3DM_N_SHAPE,
                                             S3DM_N_VERTS * 3,
                                             out_verts);
}

int hip_sam3d_body_debug_run_face_expressions(hip_sam3d_body_ctx *ctx,
                                               const float *face_coeffs,
                                               float *out_verts)
{
    if (!ctx || !face_coeffs || !out_verts) return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->cpu_mhr) {
        fprintf(stderr, "sam3d_body: MHR assets not loaded — "
                        "set cfg.mhr_assets_dir at create time\n");
        return HIP_SAM3D_BODY_E_INVAL;
    }
    const sam3d_body_mhr_assets *a = ctx->cpu_mhr;
    const float *SV = (const float *)a->face_shape_vectors.data;
    return hip_sam3d_body_run_blend_combine(ctx, face_coeffs, SV, NULL,
                                             S3DM_N_FACE,
                                             S3DM_N_VERTS * 3,
                                             out_verts);
}

/* pose_correctives — split execution.
 *
 * The 6D feat + subtract-identity + sparse-matvec + ReLU stages add up to
 * ~53k mul-adds; cheaper to keep on the host than to launch tiny kernels
 * for each. The dense Linear (55317, 3000) GEMV that follows is the only
 * GPU-worthy chunk (166M FMAs) and reuses the existing gemm_f32_bias.
 */
static void cpc_batch6d_from_xyz(const float *e, float *out6)
{
    float cx = cosf(e[0]), sx = sinf(e[0]);
    float cy = cosf(e[1]), sy = sinf(e[1]);
    float cz = cosf(e[2]), sz = sinf(e[2]);
    out6[0] = cy * cz;
    out6[1] = cy * sz;
    out6[2] = -sy;
    out6[3] = -cx * sz + sx * sy * cz;
    out6[4] = cx * cz + sx * sy * sz;
    out6[5] = sx * cy;
}

int hip_sam3d_body_debug_run_pose_correctives(hip_sam3d_body_ctx *ctx,
                                               const float *joint_params,
                                               float *out_verts)
{
    if (!ctx || !joint_params || !out_verts) return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->cpu_mhr) {
        fprintf(stderr, "sam3d_body: MHR assets not loaded — "
                        "set cfg.mhr_assets_dir at create time\n");
        return HIP_SAM3D_BODY_E_INVAL;
    }
    const sam3d_body_mhr_assets *a = ctx->cpu_mhr;
    const int V_d = S3DM_N_VERTS * 3;          /* 55317 */
    const int HID = S3DM_N_PC_H;               /* 3000  */
    const int NNZ = S3DM_N_PC_NNZ;             /* 53136 */
    const int FEAT_IN = S3DM_N_PC_IN;          /* 750   */

    const int64_t *spi_row = (const int64_t *)a->pc_sparse_indices.data;
    const int64_t *spi_col = spi_row + NNZ;
    const float   *spw     = (const float *)a->pc_sparse_weight.data;
    const float   *LW      = (const float *)a->pc_linear_weight.data;

    float *feat = (float *)malloc((size_t)FEAT_IN * sizeof(float));
    float *h    = (float *)malloc((size_t)HID     * sizeof(float));
    if (!feat || !h) { free(feat); free(h); return HIP_SAM3D_BODY_E_LOAD; }

    /* 6D feat from joints 2..126 (125 joints), euler at jp[j, 3:6]. */
    for (int jj = 0; jj < 125; jj++) {
        const float *e = joint_params + (size_t)(jj + 2) * 7 + 3;
        cpc_batch6d_from_xyz(e, feat + (size_t)jj * 6);
    }
    for (int jj = 0; jj < 125; jj++) {
        feat[(size_t)jj * 6 + 0] -= 1.0f;
        feat[(size_t)jj * 6 + 4] -= 1.0f;
    }

    /* Sparse matvec + ReLU. */
    memset(h, 0, (size_t)HID * sizeof(float));
    for (int k = 0; k < NNZ; k++) {
        int row = (int)spi_row[k];
        int col = (int)spi_col[k];
        h[row] += spw[k] * feat[col];
    }
    for (int i = 0; i < HID; i++) if (h[i] < 0.0f) h[i] = 0.0f;
    free(feat);

    /* Dense GEMV on GPU: out (1, V_d) = h (1, HID) @ LW^T (V_d, HID). */
    void *d_h = NULL, *d_LW = NULL, *d_out = NULL;
    size_t b_h   = (size_t)HID * sizeof(float);
    size_t b_LW  = (size_t)V_d * (size_t)HID * sizeof(float);
    size_t b_out = (size_t)V_d * sizeof(float);

    if (hipMalloc(&d_h,   b_h)   != hipSuccess) goto pc_fail;
    if (hipMalloc(&d_LW,  b_LW)  != hipSuccess) goto pc_fail;
    if (hipMalloc(&d_out, b_out) != hipSuccess) goto pc_fail;

    if (hipMemcpy(d_h,  h,  b_h,  hipMemcpyHostToDevice) != hipSuccess) goto pc_fail;
    if (hipMemcpy(d_LW, LW, b_LW, hipMemcpyHostToDevice) != hipSuccess) goto pc_fail;

    /* gemm_f32_bias: Y(N, D_out) = X(N, D_in) @ W^T(D_out, D_in) + b. */
    struct __attribute__((packed)) {
        void *Y; const void *X; const void *W; const void *b;
        int N; int D_in; int D_out;
    } p = { d_out, d_h, d_LW, NULL, 1, HID, V_d };
    unsigned bx = 16, by = 16;
    unsigned gx = (unsigned)((1   + bx - 1) / bx);
    unsigned gy = (unsigned)((V_d + by - 1) / by);
    if (sb_launch(ctx->fn_gemm_f32, gx, gy, 1, bx, by, 1, 0, &p, sizeof(p)) < 0)
        goto pc_fail;

