lighttransport/gemm/rdna4/sam3d_body/hip_sam3d_body_runner.c
    if (hipMemcpy(out_verts, d_out, b_out,
                  hipMemcpyDeviceToHost) != hipSuccess) goto pc_fail;

    hipFree(d_h); hipFree(d_LW); hipFree(d_out);
    free(h);
    return 0;

pc_fail:
    if (d_h)   hipFree(d_h);
    if (d_LW)  hipFree(d_LW);
    if (d_out) hipFree(d_out);
    free(h);
    return HIP_SAM3D_BODY_E_LOAD;
}

/* LBS skin_points — speculative MHR-on-GPU.
 *
 * Mirrors sam3d_body_mhr_skin_points (B=1): caller supplies the
 * global_skel (J=127, 8) and we compute jstate = skel_multiply(global,
 * inverse_bind_pose) on the host (J=127 trivial ops), upload it, then
 * scatter-add w * skel_transform_point(jstate[j], rest_verts[v]) into
 * out_verts[v] for K=51337 skin entries via atomicAdd.
 *
 * Output buffer is zeroed on device before the launch. Numerics match the
 * CPU reference up to atomicAdd reduction order; the per-vert sum has at
 * most ~16 contributions (typical LBS) so f32 accumulation drift stays at
 * ~1e-5 absolute on cm-scale verts.
 */
int hip_sam3d_body_debug_run_lbs_skin(hip_sam3d_body_ctx *ctx,
                                       const float *global_skel_host,
                                       const float *rest_verts_host,
                                       float *out_verts_host)
{
    if (!ctx || !global_skel_host || !rest_verts_host || !out_verts_host)
        return HIP_SAM3D_BODY_E_INVAL;
    if (!ctx->cpu_mhr) {
        fprintf(stderr, "sam3d_body: MHR assets not loaded — "
                        "set cfg.mhr_assets_dir at create time\n");
        return HIP_SAM3D_BODY_E_INVAL;
    }
    const sam3d_body_mhr_assets *a = ctx->cpu_mhr;
    const int J = S3DM_N_JOINTS;
    const int V = S3DM_N_VERTS;
    const int K = S3DM_N_SKIN;

    const int32_t *si  = (const int32_t *)a->skin_indices_flat.data;
    const float   *sw  = (const float   *)a->skin_weights_flat.data;
    const int64_t *vi  = (const int64_t *)a->vert_indices_flat.data;
    const float   *IBP = (const float   *)a->inverse_bind_pose.data;

    /* Compute jstate = skel_multiply(global, IBP) on host (J=127 ops). The
     * static-inline impl in sam3d_body_mhr.h is gated by IMPLEMENTATION; do
     * the math inline here to avoid pulling in the full impl block. */
    float *jstate_host = (float *)malloc((size_t)J * 8 * sizeof(float));
    if (!jstate_host) return HIP_SAM3D_BODY_E_LOAD;
    for (int j = 0; j < J; j++) {
        const float *s1 = global_skel_host + (size_t)j * 8;
        const float *s2 = IBP + (size_t)j * 8;
        float *o        = jstate_host + (size_t)j * 8;
        float sc1 = s1[7], sc2 = s2[7];
        /* rot = quat_rot_vec(q1, sc1 * t2) */
        float vx = sc1 * s2[0], vy = sc1 * s2[1], vz = sc1 * s2[2];
        float qx = s1[3], qy = s1[4], qz = s1[5], qw = s1[6];
        float avx = qy*vz - qz*vy;
        float avy = qz*vx - qx*vz;
        float avz = qx*vy - qy*vx;
        float aavx = qy*avz - qz*avy;
        float aavy = qz*avx - qx*avz;
        float aavz = qx*avy - qy*avx;
        o[0] = s1[0] + vx + 2.0f * (avx * qw + aavx);
        o[1] = s1[1] + vy + 2.0f * (avy * qw + aavy);
        o[2] = s1[2] + vz + 2.0f * (avz * qw + aavz);
        /* q1 * q2  (xyzw, w last) */
        float ax = s1[3], ay = s1[4], az = s1[5], aw = s1[6];
        float bx = s2[3], by = s2[4], bz = s2[5], bw = s2[6];
        o[3] = aw*bx + ax*bw + ay*bz - az*by;
        o[4] = aw*by - ax*bz + ay*bw + az*bx;
        o[5] = aw*bz + ax*by - ay*bx + az*bw;
        o[6] = aw*bw - ax*bx - ay*by - az*bz;
        o[7] = sc1 * sc2;
    }

    void *d_js = NULL, *d_rv = NULL, *d_si = NULL, *d_vi = NULL,
         *d_sw = NULL, *d_out = NULL;
    size_t b_js  = (size_t)J * 8 * sizeof(float);
    size_t b_rv  = (size_t)V * 3 * sizeof(float);
    size_t b_si  = (size_t)K * sizeof(int32_t);
    size_t b_vi  = (size_t)K * sizeof(int64_t);
    size_t b_sw  = (size_t)K * sizeof(float);
    size_t b_out = (size_t)V * 3 * sizeof(float);

    if (hipMalloc(&d_js,  b_js)  != hipSuccess) goto lbs_fail;
    if (hipMalloc(&d_rv,  b_rv)  != hipSuccess) goto lbs_fail;
    if (hipMalloc(&d_si,  b_si)  != hipSuccess) goto lbs_fail;
    if (hipMalloc(&d_vi,  b_vi)  != hipSuccess) goto lbs_fail;
    if (hipMalloc(&d_sw,  b_sw)  != hipSuccess) goto lbs_fail;
    if (hipMalloc(&d_out, b_out) != hipSuccess) goto lbs_fail;

    if (hipMemcpy(d_js, jstate_host,     b_js, hipMemcpyHostToDevice) != hipSuccess) goto lbs_fail;
    if (hipMemcpy(d_rv, rest_verts_host, b_rv, hipMemcpyHostToDevice) != hipSuccess) goto lbs_fail;
    if (hipMemcpy(d_si, si, b_si, hipMemcpyHostToDevice) != hipSuccess) goto lbs_fail;
    if (hipMemcpy(d_vi, vi, b_vi, hipMemcpyHostToDevice) != hipSuccess) goto lbs_fail;
    if (hipMemcpy(d_sw, sw, b_sw, hipMemcpyHostToDevice) != hipSuccess) goto lbs_fail;
    if (hipMemset(d_out, 0, b_out) != hipSuccess) goto lbs_fail;

    struct __attribute__((packed)) {
        void *out;
        const void *jstate; const void *rv;
        const void *si; const void *vi; const void *sw;
        int K;
    } p = { d_out, d_js, d_rv, d_si, d_vi, d_sw, K };
    unsigned bx = 256;
    unsigned gx = (unsigned)((K + bx - 1) / bx);
    if (sb_launch(ctx->fn_mhr_lbs, gx, 1, 1, bx, 1, 1, 0, &p, sizeof(p)) < 0)
        goto lbs_fail;

    if (hipMemcpy(out_verts_host, d_out, b_out,
                  hipMemcpyDeviceToHost) != hipSuccess) goto lbs_fail;

    hipFree(d_js); hipFree(d_rv); hipFree(d_si); hipFree(d_vi);
    hipFree(d_sw); hipFree(d_out);
    free(jstate_host);
    return 0;

lbs_fail:
    if (d_js)  hipFree(d_js);
    if (d_rv)  hipFree(d_rv);
    if (d_si)  hipFree(d_si);
    if (d_vi)  hipFree(d_vi);
    if (d_sw)  hipFree(d_sw);
    if (d_out) hipFree(d_out);
    free(jstate_host);
    return HIP_SAM3D_BODY_E_LOAD;
}
